[
    {
      "date":{
        "era":0,
        "yr":5000,
        "mm":0,
        "dd":0
      },
      "idx":0,
      "txt":"The people, Liang Zhu, are possibly the original Hmong ancestors preceding ZhiYou [1, 2]. Due to flooding and death as a result ocean immersion, the Liang Zhu migrated north (from southeast China) to Zhoulu [2]. They existed along the Yellow River in central China [1, 2]. The Liang Zhu culture is cited by some as the most advanced culture in ancient China [2]."
    },
    {
      "date":{
        "era":0,
        "yr":4800,
        "mm":0,
        "dd":0
      },
      "idx":1,
      "txt":"Yangshao Culture"
    },
    {
      "date":{
        "era":0,
        "yr":4800,
        "mm":0,
        "dd":0
      },
      "idx":2,
      "txt":"(4800--4200) Yangshao Culture, Banpo phase. Known for its pottery, burrying children in potteries, and potteries contained 'writing' that are considered by some to be proto-characters."
    },
    {
      "date":{
        "era":0,
        "yr":4000,
        "mm":0,
        "dd":0
      },
      "idx":3,
      "txt":"(4000--3000) Yangshao Culture, Miaodigou phase"
    },
    {
      "date":{
        "era":0,
        "yr":3300,
        "mm":0,
        "dd":0
      },
      "idx":4,
      "txt":"(3300--2000) Yangshao Culture, Majiayao phase"
    },
    {
      "date":{
        "era":0,
        "yr":3000,
        "mm":0,
        "dd":0
      },
      "idx":5,
      "txt":"Hmongs established Jiuli kingdom in Zhuolu, an area in northern China (today's Xie County in Shanxi Province) [1, 2, 4]. ZhiYou (also spelled ChiYou or Ci You) was the Hmong King during this time, and entered into many conflicts with his Chinese neighbors, Yandi and Huangdi, to the west and north, respectively. Most conflicts and war arose from farming and territorial disputes. Superior military arsenal kept ZhiYou's forces unstoppable and undefeated. Finally, the Chinese leaders united forces, and ten battles afterwards, Yang Long, a subordinate military commander of Yandi, cleverly released a flood into ZhiYou's valley. It was in this flood that ZhiYou was killed and the Hmongs were decisively defeated. ZhiYou had three possible burial places, all with enormous mounds, to the northwest, south east and east of Zhuolu [1]. Huangdi means Yellow Emperor; huang = yellow; di = emperor. Huangdi is also known as Xuan Yuanshi [5]. Yandi means Red Emperor [6] or Fiery Emperor; yan = fire; di = emperor. Yandi is also known as Shennong. He is credited with developing agriculture and medicine [5]. ZhiYou means Horned Emperor [6]. ZhiYou and his men used wrestling for military training [7]. This type of wrestling would later be copied by the Zhou Dynasty. Defeating ZhiYou marked the reign of Huangdi [8]. ZhiYou had 81 brothers. Said of his brothers [8], \"The 81 brothers had the body of animals and human voices, brass heads, and iron foreheads. They ate sand. They invented arms.\" ZhiYou is said to be the inventor of five kinds of weapons (wubing). However, appalled by ZhiYou, learned authorities may have later credited Huangdi [9]. ZhiYou is a deity in Han religion who protects against wild spirits [9]. After ZhiYou died, chaos resumed under Huangdi's rule. Huangdi ordered for ZhiYou's image to be placed throughout the land to restore order [9]. The taotie image on bronzes is ZhiYou [10]. Although the taotie motif is recognized with negative connotations today, it was originally worshiped as an auspicious deity [10]. Huangdi and Yandi's alliance would fall apart after the defeat of ZhiYou. They would fight for supremacy in three battles at Banquan, where Huangdi would prevail. The Yan and Huang people would merge and form what is known today as the Huaxia race--ethnic Han or Chinese people [5]."
    },
    {
      "date":{
        "era":0,
        "yr":3000,
        "mm":0,
        "dd":0
      },
      "idx":6,
      "txt":"After the defeat of ZhiYou, the Hmongs again migrated downward to the central China and later southern China. While in central China, Tao Te and Huang Tua, established the San Miao Kingdom or Peb Hmoob [1]. Hereafter, the Hmong people would continue to migrate from north to south and east to west [2]."
    },
    {
      "date":{
        "era":0,
        "yr":3000,
        "mm":0,
        "dd":0
      },
      "idx":7,
      "txt":"Zhi You is said to have three sons. From oldest to youngest, the sons were, Pang Ci, Fu Ci, and Li Ci [2]. Li Ci led some Hmong to the north. Fu Ci's followers stayed behind and merged into the Han. These Hmong are said to have kept and preserve relics of Zhi You which is found in Zhi You village, in Zu Lu county in Hubei province [2]. Some of these relics include a castle, fountain, pond, and pine tree [1, 2]. Pang Ci led some Hmong to the south. Pang Ci's group of Hmong established \"The Three Miao Groups\" or San Miao. Today's generations of Hmong are said to be descended from Pang Ci's Hmong group."
    },
    {
      "date":{
        "era":0,
        "yr":3000,
        "mm":0,
        "dd":0
      },
      "idx":8,
      "txt":"It is believed that most of Hmong culture was developed during the Jiuli time since it was a period of peace and prosperity. Later times, when Hmong would no longer have sovereignty and be engaged in frequent war fares, the development of Hmong culture is said to even stop [2]."
    },
    {
      "date":{
        "era":0,
        "yr":3000,
        "mm":0,
        "dd":0
      },
      "idx":9,
      "txt":"(3000--1900) Longshan Culture was known as the Black Pottery Culture and existed in the middle and lower Yellow River valley areas of northern China."
    },
    {
      "date":{
        "era":0,
        "yr":3000,
        "mm":0,
        "dd":0
      },
      "idx":10,
      "txt":"Henan means 'south of the (Yellow) River'. Huanghe means 'Yellow River': Hmong people recall Huanghe with a saying, \"tsis pom Dej Dag ces siab tsis nqig\", which translates loosely into \"if one does not see the Yellow River, then his heart is not content.\" Henan is regarded as the cradle of Far Eastern Civilization. Much archaeological finds of ancient civilizations occur in the Henan region [11]."
    },
    {
      "date":{
        "era":0,
        "yr":2852,
        "mm":0,
        "dd":0
      },
      "idx":11,
      "txt":"(2852--2070) Three August Ones and Five Emperors were a group of mythological rulers or deities."
    },
    {
      "date":{
        "era":0,
        "yr":2700,
        "mm":0,
        "dd":0
      },
      "idx":12,
      "txt":"(2700--2300) Yangshao Culture, Banshan phase"
    },
    {
      "date":{
        "era":0,
        "yr":2400,
        "mm":0,
        "dd":0
      },
      "idx":13,
      "txt":"(2400--2000) Yangshao Culture, Machang phase"
    },
    {
      "date":{
        "era":0,
        "yr":2200,
        "mm":0,
        "dd":0
      },
      "idx":14,
      "txt":"San Miao nation is established after fall of Jiuli. The San Miao nation probably existed in the middle reaches of the Yangtze River [12]. San Miao spanned the Han rulers of Yao, Shun, and Yu--three of the 5 so called Sage Kings (Wu Di). There were tremendous climatic changes during this era for all the people. Long stretches of flooding around the Yellow River lasting over a decade was one problem that in particular that plagued the population. The Miao speaking the western dialect was the main power of San Miao [2]. Yao, Shun, and Yu were not from the same family. Each ruler, except for the last, following the example set by Yao, abdicated the throne to the best candidate they could find [13]. This system of handing down the throne was called, shanrang. When Yu died, the throne was passed to his son, and started the shixi system of handing the throne to a family member and also dynastic rule. All three spent a great deal of their reign battling floods."
    },
    {
      "date":{
        "era":0,
        "yr":2200,
        "mm":0,
        "dd":0
      },
      "idx":15,
      "txt":"Yao is said to have banished people of the San Miao nation to Sanwei Shan (Sanwei Mountain) [14]."
    },
    {
      "date":{
        "era":0,
        "yr":2200,
        "mm":0,
        "dd":0
      },
      "idx":16,
      "txt":"Shun, the second sovereign of whose reign there is record (2200 B. c.), is said to have waged war with San Miao, three tribes of Miaotze or aborigines, a term still applied to the independent tribes of the southwest. Beaten in the field, or at least suffering a temporary check, he betook himself to the rites of religion, making offerings and praying to Shang-ti, the supreme ruler. \"After forty days the natives submitted.\" [15] Shun died while engaged in a punitive expedition against San Miao [14]."
    },
    {
      "date":{
        "era":0,
        "yr":2200,
        "mm":0,
        "dd":0
      },
      "idx":17,
      "txt":"Yu the Great defeated the San-Miao Kingdom and was believed to have exterminated largely the people of San Miao. [1, 16] After the Miao were defeated, they moved south to the Dongting Hu (Dongting Lake) region. The provinces, Hunan (South of the Lake) and Hubei (North of the Lake) are named in geographic reference to Dongting Hu. 9/12/1912: It is said there was a double sunset when the San-Miao Kingdom fell (solar eclipse) [17]."
    },
    {
      "date":{
        "era":0,
        "yr":2200,
        "mm":0,
        "dd":0
      },
      "idx":18,
      "txt":"Geographic separation of the Three Miao Groups began after the fall of San Miao [2]."
    },
    {
      "date":{
        "era":0,
        "yr":2070,
        "mm":0,
        "dd":0
      },
      "idx":19,
      "txt":"(2070-–1600) Xia Chao (Xyam Tshoj)"
    },
    {
      "date":{
        "era":0,
        "yr":1600,
        "mm":0,
        "dd":0
      },
      "idx":20,
      "txt":"(1600--1046) Shang Chao (Sab Tshoj) Doctrine of 'mandate of heaven' (tian.ming) and 'son of heaven' (tian.zi) established [18]."
    },
    {
      "date":{
        "era":0,
        "yr":1122,
        "mm":0,
        "dd":0
      },
      "idx":21,
      "txt":"(1122--256) Zhou Chao (Tsuab Tshoj)"
    },
    {
      "date":{
        "era":0,
        "yr":722,
        "mm":0,
        "dd":0
      },
      "idx":22,
      "txt":"(722--481) Spring and Autumn Period"
    },
    {
      "date":{
        "era":0,
        "yr":704,
        "mm":0,
        "dd":0
      },
      "idx":23,
      "txt":"(704--223) The Chu Kingdom arose after the San Miao Kingdom from 704 BC until defeated by the Chinese in 223 AD through the strategy of divide and conquer. The Chu Kingdom was have possibly been a Hmong Kingdom or belong to any number of other people [20]. Language analysis show the Chu language to be closer to the Hmong [21] since Hmong people have the nasal sounds as did the Chu people. In any event, the Chu language was mutually unintelligible with the court of Zhou [22]. If the Chu Kingdom was Hmong, no subsequent Hmong Kingdom compared in size and greatness to the Chu Kingdom. During this time, the Chinese also began their process of assimilating minorities into the Chinese culture. This era also escalated the endless friction and wars between the Chinese and Hmong [1]. Modern day character used to reference Chu Kingdom means 'clear'. Hmong oral history recalls a kingdom called Tswb Tshoj, where tswb means pig and tshoj means nation. It has been speculated that Tswb Tshoj was Chu Chao. In Chinese, chao, means dynasty. Chu Kingdom boasted over 1 million soldiers (Qin State) Chu Kingdom was located where Han and Yangtze Rivers meet [23] (Dongting Lake area). The use of iron first began with the Chu Kingdom around 400 BC [24]. Capital of Chu was Jinan [24], Ying [25], or Danyang [19]. Chu culture was said to be essential to the development and progress of Chinese culture [26]. Contrast to previous thought, it was Chu culture that spread upwards to the Chinese and not the other way around [26]. Chu was the first to organize newly conquered land into xian. A xian was not governed by hereditary feudatory lords, but by an official appointed by the ruler of the state [27]. The people of Chu believed in the power of Shamans and spirits [28]. Chu used the difficult to read script called \"Birds and Worms (鸟虫文}\" style [19]."
    },
    {
      "date":{
        "era":0,
        "yr":704,
        "mm":0,
        "dd":0
      },
      "idx":24,
      "txt":"Duke of Chǔ (楚), Mǐ Xióng Tōng (羋熊通), saw the weakened power of the King of Zhou as an opportunity to break free from being a tributary state of the Zhou Dynasty and claimed the title of king himself. He announced the kingdom of Chǔ (楚國) and called himself King Wu of Chu (楚武王) [25]."
    },
    {
      "date":{
        "era":0,
        "yr":684,
        "mm":9,
        "dd":0
      },
      "idx":25,
      "txt":"A man of Chu defeated the Cai host at Xin, and carried off Lord of Cai [30]."
    },
    {
      "date":{
        "era":0,
        "yr":678,
        "mm":0,
        "dd":0
      },
      "idx":26,
      "txt":"Autumn, A man of Chu attacked Zheng [30]."
    },
    {
      "date":{
        "era":0,
        "yr":678,
        "mm":12,
        "dd":0
      },
      "idx":27,
      "txt":"Lu, Qi, Song, Chen, Wei, Zheng, Xu, Huo, Teng, made common cause at You [30]."
    },
    {
      "date":{
        "era":0,
        "yr":671,
        "mm":0,
        "dd":0
      },
      "idx":28,
      "txt":"Summer, A man of Chu made a state visit to Lu [30]."
    },
    {
      "date":{
        "era":0,
        "yr":666,
        "mm":0,
        "dd":0
      },
      "idx":29,
      "txt":"Autumn, Chu attacked Zheng [30]."
    },
    {
      "date":{
        "era":0,
        "yr":659,
        "mm":7,
        "dd":0
      },
      "idx":30,
      "txt":"A man of Chu attacked Zheng [30]."
    },
    {
      "date":{
        "era":0,
        "yr":659,
        "mm":8,
        "dd":0
      },
      "idx":31,
      "txt":"Lu, Qi, Song, Zheng, Cao, Zhu met at Cheng [30]."
    },
    {
      "date":{
        "era":0,
        "yr":658,
        "mm":0,
        "dd":0
      },
      "idx":32,
      "txt":"Winter, A man of Chu attacked Zheng [30]."
    },
    {
      "date":{
        "era":0,
        "yr":657,
        "mm":0,
        "dd":0
      },
      "idx":33,
      "txt":"Winter, A man of Chu attacked Zheng [30]."
    },
    {
      "date":{
        "era":0,
        "yr":656,
        "mm":0,
        "dd":0
      },
      "idx":34,
      "txt":"Summer, Qu Wan of Chu came to make a covenant with the invading host; the covenant was made at Shao-ling. A man of Qi made prisoner Yuan Tao-hu of Chen [30]."
    },
    {
      "date":{
        "era":0,
        "yr":656,
        "mm":0,
        "dd":0
      },
      "idx":35,
      "txt":"Autumn, Lu, Jiang, and Huang attacked Chen [30]."
    },
    {
      "date":{
        "era":0,
        "yr":656,
        "mm":1,
        "dd":0
      },
      "idx":36,
      "txt":"Lu, Qi, Song, Chen, Wei, Zheng, Xu, Cao, attacked Cai. The Cai dispersed; they then invaded Chu, halting at Xin [30]."
    },
    {
      "date":{
        "era":0,
        "yr":656,
        "mm":8,
        "dd":0
      },
      "idx":37,
      "txt":"Lu Prince arrived from attacking Chu [30]."
    },
    {
      "date":{
        "era":0,
        "yr":656,
        "mm":12,
        "dd":0
      },
      "idx":38,
      "txt":"Gongsun Zi led the Lu host, and with contingents from Qi, Song, Wei, Zheng, Xu, and Cao, invaded Chen [30]."
    },
    {
      "date":{
        "era":0,
        "yr":655,
        "mm":0,
        "dd":0
      },
      "idx":39,
      "txt":"Summer, Lu, Qi, Song, Chen, Wei, Zheng, Xu, and Cao met with the Royal Heir Presumptive at Shou-zhi"
    },
    {
      "date":{
        "era":0,
        "yr":655,
        "mm":8,
        "dd":0
      },
      "idx":40,
      "txt":"The above made a covenant in Shou-zhi. The Ruler of Zheng left the meeting, and did not covenant. A man of Chu extinguished Xian; the Master of Xian fled to Huang [30]."
    },
    {
      "date":{
        "era":0,
        "yr":654,
        "mm":0,
        "dd":0
      },
      "idx":41,
      "txt":"Summer, Lu, Qi, Song, Chen, Wei, and Cao attacked Zheng and invested Xin-Cheng [30]."
    },
    {
      "date":{
        "era":0,
        "yr":654,
        "mm":0,
        "dd":0
      },
      "idx":42,
      "txt":"Autumn, A man of Chu invested Xu. The above forthwith went to the rescue of Xu [30]."
    },
    {
      "date":{
        "era":0,
        "yr":654,
        "mm":0,
        "dd":0
      },
      "idx":43,
      "txt":"Winter, Lu Prince arrived from attacking Zheng [30]."
    },
    {
      "date":{
        "era":0,
        "yr":649,
        "mm":0,
        "dd":0
      },
      "idx":44,
      "txt":"Winter, A man of Chu attacked Huang [30]."
    },
    {
      "date":{
        "era":0,
        "yr":648,
        "mm":0,
        "dd":0
      },
      "idx":45,
      "txt":"Summer, A man of Chu extinguished Huang [30]."
    },
    {
      "date":{
        "era":0,
        "yr":645,
        "mm":0,
        "dd":0
      },
      "idx":46,
      "txt":"Spring, A man of Chu attacked Xu [30]."
    },
    {
      "date":{
        "era":0,
        "yr":645,
        "mm":3,
        "dd":0
      },
      "idx":47,
      "txt":"Lu, Qi, Song, Chen, Wei, Zheng, Xu, and Cao covenanted at Mou-qiu, and forthwith encamped at Kuang. Gongsun Gao led the force and with the above went to the relief of Xu [30]."
    },
    {
      "date":{
        "era":0,
        "yr":633,
        "mm":0,
        "dd":0
      },
      "idx":48,
      "txt":"In the winter, King Cheng of Chu struck at Song, the ally of Jin most accessible from the south. In retaliation, an expeditionary force under Duke Wen of Jin marched south in the spring of next year and occupied Wei and Cao, both satellites of Chu. Both sides sought out alliances in the following months. The states of Shen, Xi, Chen, Cai, all immediately contiguous to Chu, sided with King Cheng, as well as the more distant Lu [31]."
    },
    {
      "date":{
        "era":0,
        "yr":632,
        "mm":0,
        "dd":0
      },
      "idx":49,
      "txt":"Battle of Chengpu (城濮之戰) between the states of Jin against Chu and its allies. Viewed as the first great battle in the protracted conflict between the states of the Yellow River valley, and the states of the Yangtze River (Chang Jiang) valley. The Jin victory confirmed the hegemony of Duke Wen and checked Chu ambitions in the north for at least a generation. The battle, however, was not effective in the long term in restricting the power of Chu [31]."
    },
    {
      "date":{
        "era":0,
        "yr":613,
        "mm":0,
        "dd":0
      },
      "idx":50,
      "txt":"King Zhuang of Chu. His exploits gave rise to Four Character Idioms. 606 BC: King Zhuang of Chu sent out an envoy to the court of King Dingwang of Zhou to express his will to swallow the royal domain of Zhou [32]. 611 BC: King Zhuang of Chu annexed state of Yong. 591 BC: King Zhuang of Chu died."
    },
    {
      "date":{
        "era":0,
        "yr":598,
        "mm":0,
        "dd":0
      },
      "idx":51,
      "txt":"King Zhuang of Chu crushed the small state of Chen [32]."
    },
    {
      "date":{
        "era":0,
        "yr":597,
        "mm":0,
        "dd":0
      },
      "idx":52,
      "txt":"King Zhuang of Chu crushed the small state of Zheng. Qi state declared allegiance to Chu [32]."
    },
    {
      "date":{
        "era":0,
        "yr":589,
        "mm":0,
        "dd":0
      },
      "idx":53,
      "txt":"Jin fought with Qi at the battle of An. Chu declared war on Jin [32]."
    },
    {
      "date":{
        "era":0,
        "yr":579,
        "mm":0,
        "dd":0
      },
      "idx":54,
      "txt":"After a period of increasingly exhaustive warfare, Qi, Qin, Jin and Chu finally met for a disarmament conference where the other states essentially became satellites [25]."
    },
    {
      "date":{
        "era":0,
        "yr":576,
        "mm":0,
        "dd":0
      },
      "idx":55,
      "txt":"Chu first attacked Zheng and Wei [32]."
    },
    {
      "date":{
        "era":0,
        "yr":575,
        "mm":0,
        "dd":0
      },
      "idx":56,
      "txt":"Chu lose battle to Jin at battle of Yanling [32]."
    },
    {
      "date":{
        "era":0,
        "yr":549,
        "mm":0,
        "dd":0
      },
      "idx":57,
      "txt":"King Kong of Chu Kingdom sent fleet to attack Wu Kingdom [29]."
    },
    {
      "date":{
        "era":0,
        "yr":549,
        "mm":0,
        "dd":0
      },
      "idx":58,
      "txt":"(549--476) Twenty recorded naval battles between Wu and Chu Kingdoms [29]."
    },
    {
      "date":{
        "era":0,
        "yr":548,
        "mm":0,
        "dd":0
      },
      "idx":59,
      "txt":"Chu began to register its people for taxation and military purposes [27]."
    },
    {
      "date":{
        "era":0,
        "yr":546,
        "mm":0,
        "dd":0
      },
      "idx":60,
      "txt":"Jin and Chu mutually ended war against each other and took over 14 smaller states [25, 32]."
    },
    {
      "date":{
        "era":0,
        "yr":525,
        "mm":0,
        "dd":0
      },
      "idx":61,
      "txt":"Prince Guang of Wu twice sent fleet to attack the coast of the Chu Kingdom [29]."
    },
    {
      "date":{
        "era":0,
        "yr":500,
        "mm":0,
        "dd":0
      },
      "idx":62,
      "txt":"(500--221) Waring States Period"
    },
    {
      "date":{
        "era":0,
        "yr":400,
        "mm":0,
        "dd":0
      },
      "idx":63,
      "txt":"The Chu government had become very corrupt and inefficient with much of the state's treasury to pay for a large official retinue. Many officials had no meaningful task to the state except taking money. Thus, Chu's large army was of low quality due to poor funding [19]."
    },
    {
      "date":{
        "era":0,
        "yr":390,
        "mm":0,
        "dd":0
      },
      "idx":64,
      "txt":"King Dao of Chu (楚悼王) made Wu Qi his prime minister. Wu Qi's reforms began in 389 BCE to transform Chu into an efficient and powerful state, lowering the salaries of officials and removing useless ones. He also enacted building codes to make the capital, Ying seem less barbaric. Despite Wu Qi's massive unpopularity with the Chu government (except the King), his reforms made Chu very powerful until the early 300's BCE, when Zhao and Qin were ascendant. Chu's powerful army annexed Chen and Cai states, defeating the states of Wei and Yue [19]."
    },
    {
      "date":{
        "era":0,
        "yr":381,
        "mm":0,
        "dd":0
      },
      "idx":65,
      "txt":"Wu Qi was assassinated by the Chu officials at the funeral of King Dao [19]."
    },
    {
      "date":{
        "era":0,
        "yr":333,
        "mm":0,
        "dd":0
      },
      "idx":66,
      "txt":"Chu and Qi partitioned and annexed the coastal state of Yue [19]."
    },
    {
      "date":{
        "era":0,
        "yr":321,
        "mm":0,
        "dd":0
      },
      "idx":67,
      "txt":"Qi and Chu formed alliance against Qin [33]."
    },
    {
      "date":{
        "era":0,
        "yr":319,
        "mm":0,
        "dd":0
      },
      "idx":68,
      "txt":"When King of Wei died, he asked Qin to vacate from Wei. Qi, Chu, Han, Zhao, and Yan attacked Qin on Wei's behalf [33]."
    },
    {
      "date":{
        "era":0,
        "yr":318,
        "mm":0,
        "dd":0
      },
      "idx":69,
      "txt":"Qi and Chu disagreement over military command ended joint campaign against Qin [33]."
    },
    {
      "date":{
        "era":0,
        "yr":307,
        "mm":0,
        "dd":0
      },
      "idx":70,
      "txt":"Hua Bazi, an imperial concubine of King Hui Wen of Qin, aided by her stepbrother, Wei Ran, politically manipulated for her son, Ce, to become king of Qin after the heir appearant, Dang, died in a weight lifting accident. Hua Bazi would become known as Queen Dowager Xuan, and her son would become known as King Zhao Xiang [34]. Hua Bazi was born in Chu, and would maintain a friendly relationship with Chu [34]. Queen Dowager Xuan would effectively rule and administer Qin with the help of Wei Ran and prime minister Chu Liji for 41 years [34]."
    },
    {
      "date":{
        "era":0,
        "yr":306,
        "mm":0,
        "dd":0
      },
      "idx":71,
      "txt":"Chu invaded Han [34]. Queen Dowager Xuan of Qin refused to send troops to the aid of Han [34]."
    },
    {
      "date":{
        "era":0,
        "yr":305,
        "mm":0,
        "dd":0
      },
      "idx":72,
      "txt":"Queen Dowager Xuan forced her son, Ce, to marry a princess of Chu, as his queen [34]."
    },
    {
      "date":{
        "era":0,
        "yr":302,
        "mm":0,
        "dd":0
      },
      "idx":73,
      "txt":"Qi, Qin, and Chu made agreement to recognize the hegemony of the 3 states. The tripartite agreement ended when a Chu prince living in Qin killed a patrician and fled [33]."
    },
    {
      "date":{
        "era":0,
        "yr":299,
        "mm":0,
        "dd":0
      },
      "idx":74,
      "txt":"King Huai of Chu was allured to visit the court of Qin. He was taken prisoner and died. He was succeeded by King Qingziang. The Chu capital was sacked, forcing King Qingziang to move eastward. The death of King Huai marked the beggining of the end of the Chu Kingdom [32]."
    },
    {
      "date":{
        "era":0,
        "yr":266,
        "mm":0,
        "dd":0
      },
      "idx":75,
      "txt":"Queen Dowager Xuan was cut from power by her son, King Zhao Xiang [34]."
    },
    {
      "date":{
        "era":0,
        "yr":264,
        "mm":0,
        "dd":0
      },
      "idx":76,
      "txt":"Queen Dowager Xuan died and was titled, outsanding stateswoman [34]."
    },
    {
      "date":{
        "era":0,
        "yr":230,
        "mm":0,
        "dd":0
      },
      "idx":77,
      "txt":"Han fell to Qin [33]."
    },
    {
      "date":{
        "era":0,
        "yr":228,
        "mm":0,
        "dd":0
      },
      "idx":78,
      "txt":"Zhao fell to Qin [33]."
    },
    {
      "date":{
        "era":0,
        "yr":226,
        "mm":0,
        "dd":0
      },
      "idx":79,
      "txt":"Yan fell to Qin [33]."
    },
    {
      "date":{
        "era":0,
        "yr":225,
        "mm":0,
        "dd":0
      },
      "idx":80,
      "txt":"Wei fell to Qin [33]."
    },
    {
      "date":{
        "era":0,
        "yr":225,
        "mm":0,
        "dd":0
      },
      "idx":81,
      "txt":"First invasion by Qin troops were defeated by 500,000 Chu troops in the unfamiliar territory of Huaiyang, modern-day northern Jiangsu and Anhui provinces. The Qin general was Li Xing, who was inexperienced [19]."
    },
    {
      "date":{
        "era":0,
        "yr":224,
        "mm":0,
        "dd":0
      },
      "idx":82,
      "txt":"Wang Jian, was called by Qin King to lead a second invasion with 600,000 men. Chu's morale was greatly increased after their success in defeating the seemingly invincible army of Qin the year before. The Chu forces were content to sit back and defend and believed it was Qin's intention to besiege Chu. However, Wang Jian tricked the Chu army by appearing to play around in his fortifications but secretly training his troops to fight in Chu territory. After a year, Chu decided to disband due to inaction. Wang Jian invaded at the best moment with full force to overrun Huaiyang and the remaining Chu forces. Chu lost the initiative and could only sustain local guerrilla-style resistance until fully conquered in 223 BCE. During their peak sizes, both armies of Chu and Qin combined numbered over 1,000,000 troops [19]."
    },
    {
      "date":{
        "era":0,
        "yr":223,
        "mm":0,
        "dd":0
      },
      "idx":83,
      "txt":"Chu fell to Qin [33]. Since Chu was the last state to fall, only 11 years before the death of Qin Shihuang and did not suffer great massacres or destruction, it was the leading state in the anti-Qin rebellion. Chu people were resentful of the forced labor under Qin and folk poems record the sadness of the Chu families of men who worked in the frigid north to construct the Great Wall of China. Eventually, two men from the Chu land, Liu Bang and Xiang Yu led the anti-Qin revolution and fought each other in the Chu-Han Contention to rule China. Liu Bang prevailed and created the Han Dynasty that lasted for 400 years [19]."
    },
    {
      "date":{
        "era":0,
        "yr":221,
        "mm":0,
        "dd":0
      },
      "idx":84,
      "txt":"Qi fell to Qin [33]."
    },
    {
      "date":{
        "era":0,
        "yr":221,
        "mm":0,
        "dd":0
      },
      "idx":85,
      "txt":"(221--206) Qin Chao (Cheej Tshoj)"
    },
    {
      "date":{
        "era":0,
        "yr":209,
        "mm":0,
        "dd":0
      },
      "idx":86,
      "txt":"Revolts against Qin rule broke out across the empire. A Chu state was formed by Xiang Yu [35]."
    },
    {
      "date":{
        "era":0,
        "yr":206,
        "mm":0,
        "dd":0
      },
      "idx":87,
      "txt":"(206 BC--220 AD) Xi Han Chao (Ham Tshoj)"
    },
    {
      "date":{
        "era":0,
        "yr":206,
        "mm":0,
        "dd":0
      },
      "idx":88,
      "txt":"(206 BC--220 AD) Dong Han Chao (Ham Tshoj)"
    },
    {
      "date":{
        "era":0,
        "yr":206,
        "mm":0,
        "dd":0
      },
      "idx":89,
      "txt":"(206--202 BC) Chu State emerged to challenge Han State to succeed the Qin Dynasty [21]."
    },
    {
      "date":{
        "era":0,
        "yr":206,
        "mm":0,
        "dd":0
      },
      "idx":90,
      "txt":"Chu King Xiang Yu's lieutenant, Liu Bang, defeated the third and last Qin emperor at the valley of Wei. Liu Bang turned against Xiang Yu and eventually accumulated enough land to declare himself emperor with the title Gao Zu (High Progenitor). Liu Bang's rule would eventually become the Han Dynasty [35]."
    },
    {
      "date":{
        "era":0,
        "yr":206,
        "mm":0,
        "dd":0
      },
      "idx":91,
      "txt":"The Yelang Kingdom was an ancient minor kingdom in what is now Guizhou Province during the Han Dynasty. This kingdom lasted from 206 BC--220 AD [36]. Legend tells of how a girl washing clothes in the river found a boy in large piece of bamboo who would later become the King of Yelang [37]. There is a saying, \"Yelang zida\", which translates to \"Yelang is self-conceited.\" The story behind this phrase is that when an envoy from the Han empire came to Yelang, the King of Yelang asked the envoy, \"Which is bigger, Han or Yelang?\" Yelang was large enough only to be compared with a prefecture of Han [38]. It is said, the same Han envoy first went to the neighboring Dian Kingdom, also equally small in size to the Yelang Kingdom, whose King also asked the Han envoy the same question [39]. Other sources place the Yelang Kingdom as early as 475 BC--26 BC [40] or 5th century BC to the later Han Dynasty [41]. Yelang people were said to wear their hair up, have supernatural skills, lead farming lives and have strong armies, according to records from such history books as The Historian and The Han Shu [41]. Yelang was not a powerful state but an alliance of several tribes across areas in Guizhou and neighboring provinces [41]. Kele may have been the center of the Yelang Kingdom [41]. The rulers of Yelang may have been Yi people as Kele is predominantly Yi [41]. However, surronding Kele are many Miao people as well [41]."
    },
    {
      "date":{
        "era":1,
        "yr":8,
        "mm":0,
        "dd":0
      },
      "idx":92,
      "txt":"(8--23) Xin Chao"
    },
    {
      "date":{
        "era":1,
        "yr":220,
        "mm":0,
        "dd":0
      },
      "idx":93,
      "txt":"(220--265) Sanguo (Xab Kuj)"
    },
    {
      "date":{
        "era":1,
        "yr":220,
        "mm":0,
        "dd":0
      },
      "idx":94,
      "txt":"(220--265) Wei [42]"
    },
    {
      "date":{
        "era":1,
        "yr":221,
        "mm":0,
        "dd":0
      },
      "idx":95,
      "txt":"(221--263) Shu [42]"
    },
    {
      "date":{
        "era":1,
        "yr":229,
        "mm":0,
        "dd":0
      },
      "idx":96,
      "txt":"(229--280) Wu [42]"
    },
    {
      "date":{
        "era":1,
        "yr":265,
        "mm":0,
        "dd":0
      },
      "idx":97,
      "txt":"(265--419) Jin Chao (Ceem Tshoj)"
    },
    {
      "date":{
        "era":1,
        "yr":386,
        "mm":0,
        "dd":0
      },
      "idx":98,
      "txt":"(386--533) Northern Wei [42]"
    },
    {
      "date":{
        "era":1,
        "yr":400,
        "mm":0,
        "dd":0
      },
      "idx":99,
      "txt":"(400--900) A Hmong kingdom was established. This kingdom was a hereditary monarchy, organized into village and districts and men were allowed to 'vote' in political processes. The Song dynasty ended this kingdom and the Hmong returned to their nomadic way of life [43]. The area of this kingdom is said to be in the area of the Five Lakes region of Hubei and Hunan [11]."
    },
    {
      "date":{
        "era":1,
        "yr":403,
        "mm":0,
        "dd":0
      },
      "idx":100,
      "txt":"(403--561) 158 years of frequent fighting occurred between the Hmongs and Chinese. It is said that every 4 years a major war occurred between the Hmongs and Chinese [1]."
    },
    {
      "date":{
        "era":1,
        "yr":420,
        "mm":0,
        "dd":0
      },
      "idx":101,
      "txt":"420--589: Nanbei Chao"
    },
    {
      "date":{
        "era":1,
        "yr":420,
        "mm":0,
        "dd":0
      },
      "idx":102,
      "txt":"(420--478) Song (Xom Tshoj) [42]"
    },
    {
      "date":{
        "era":1,
        "yr":479,
        "mm":0,
        "dd":0
      },
      "idx":103,
      "txt":"(479--501) Qi [42]"
    },
    {
      "date":{
        "era":1,
        "yr":502,
        "mm":0,
        "dd":0
      },
      "idx":104,
      "txt":"(502--556) Liang [42]"
    },
    {
      "date":{
        "era":1,
        "yr":534,
        "mm":0,
        "dd":0
      },
      "idx":105,
      "txt":"(534--549) Eastern Wei [42]"
    },
    {
      "date":{
        "era":1,
        "yr":535,
        "mm":0,
        "dd":0
      },
      "idx":106,
      "txt":"(535--557) Western Wei [42]"
    },
    {
      "date":{
        "era":1,
        "yr":550,
        "mm":0,
        "dd":0
      },
      "idx":107,
      "txt":"(550--577) Northern Qi [42]"
    },
    {
      "date":{
        "era":1,
        "yr":557,
        "mm":0,
        "dd":0
      },
      "idx":108,
      "txt":"(557--588) Chen [42]"
    },
    {
      "date":{
        "era":1,
        "yr":557,
        "mm":0,
        "dd":0
      },
      "idx":109,
      "txt":"(557--588) Northern Zhou [42]"
    },
    {
      "date":{
        "era":1,
        "yr":581,
        "mm":0,
        "dd":0
      },
      "idx":110,
      "txt":"(581--619) Sui Chao (Xij Tshoj)"
    },
    {
      "date":{
        "era":1,
        "yr":618,
        "mm":0,
        "dd":0
      },
      "idx":111,
      "txt":"(618--868) Tang Chao (Thaj Tshoj). Hmong flourished in the areas of metallurgy, business, and trade [44]."
    },
    {
      "date":{
        "era":1,
        "yr":811,
        "mm":0,
        "dd":0
      },
      "idx":112,
      "txt":"Zhang Bo Jing (Tsab Pej Ceem) led a war against Tang Emperor. The Tang Emperor during this time was Yuan He. Zhang Bo Jin gathered the support of multiple ethnic group from Funan, Guizhou, and Guangxi using blood drinking ceremony. The people of Zhang Bo Jing suffered a horrible agricultural season from heavy rain and were forced into construction work [44]."
    },
    {
      "date":{
        "era":1,
        "yr":811,
        "mm":11,
        "dd":0
      },
      "idx":113,
      "txt":"The Tang Emperor Xian Zong removed the governor of Funan for ineffectiveness against stopping Zhang Bo Jing. After serious defeats, Xian Zong called soldiers from Hubei, Guangdong, Guangxi, and Fujian to fight against Zhang Bo Jing. By this time, Zhang Bo Jin's created opertional headquarters at Chang Zhou and Xu Zhou. Zhang Bo Jin's strategy became mainly a defensive one choosing locations of battles that were difficult to attack but easy to defend [44]."
    },
    {
      "date":{
        "era":1,
        "yr":813,
        "mm":0,
        "dd":0
      },
      "idx":114,
      "txt":"After suffering nine major battle defeats, the Tang Emperor called for a meeting. The group had 2 factions, one espousing more military campaigns and the other favoring the use of diplomatic measures. The group eventually decided to hold talks with Zhang Bo Jing. Talks with Zhang Bo Jing ended the war. The Hmong were granted increased autonomy in certain regions [44]."
    },
    {
      "date":{
        "era":1,
        "yr":897,
        "mm":0,
        "dd":0
      },
      "idx":115,
      "txt":"The Tang Dynasty entered its final days and a period of chaos nearing anarchy came to be. The ruler of Funan, Ma Yin, wanted to increase his territory and took the opportunity of the circumstances to attack Hmong people in the Five Lakes Region. Several Hmong leaders rose to challenge Ma Yin. Among the Hmong leaders were Pan Jin Sheng (Phab Ceeb Seem) from Cheng Zhou (Tsheej Tsawb), Yang Cheng Lu (Yaj Tsheej Lis), Song Ye (Xoom Yig) from Cheng Zhou (Tshaj Tsawb), and Chang Shi Yi (Tshab Xib Yij) from Xu Zhou (Xyim Tsawb). Ma Yin's first attack was at Fei Shan Dong (Feb Sab Toom), where he was met with forces led by Pan Jin Sheng, Song Ye, and Shi Yi. Meanwhile, Yang Cheng Lu, attacked Ma Yin's headquarter at Wu Gang (Vws Kab) [44]."
    },
    {
      "date":{
        "era":1,
        "yr":907,
        "mm":0,
        "dd":0
      },
      "idx":116,
      "txt":"(907--960) Wudai Shiguo (Swj Kuj)"
    },
    {
      "date":{
        "era":1,
        "yr":907,
        "mm":0,
        "dd":0
      },
      "idx":117,
      "txt":"(907--1125) Liao Chao founded by Khitan [45]."
    },
    {
      "date":{
        "era":1,
        "yr":907,
        "mm":0,
        "dd":0
      },
      "idx":118,
      "txt":"The Liao Emperor, Kai Ping, gave more power to Ma Yin [44]."
    },
    {
      "date":{
        "era":1,
        "yr":910,
        "mm":12,
        "dd":4
      },
      "idx":119,
      "txt":"Pan Jin Sheng and Song Ye went on the offensive attacked Ma Yin. Song Ye was able to take Xiangxiang quickly."
    },
    {
      "date":{
        "era":1,
        "yr":911,
        "mm":0,
        "dd":0
      },
      "idx":120,
      "txt":"The Liao Emperor sent Lu Shi Zhou to attack the Hmong. Lu Shi Zhou first attacked Yang Cheng Lu at Wu Gang. Lu Shi Zhou had placed his troops in key locations and guarding the roads. Yang Cheng Lu's men were unable to penetrate through Lu Shi Zhou's line of defense to escape, and took heavy losses from cannons. After Yang Cheng Lu was killed, the captured men of Yang Cheng Lu were forced to take the Liao troops to Fei Shan Dong where Pan Jin Sheng was located. Pan Jin Sheng was overwhelmed and captured with 3,000 of his men. Pan Jin Sheng was taken back to Wu Gang and killed. Lu Shi Zhou was able to achieve victory by multiplying his army, spreading their attacks, and using cannons. In one day, Lu Shi Zhou was able to take over Wu Gang and Fei Shan Dong. Pan Jin Sheng's 14 years of war against the Tang and Liao Dynasties came to an end. Song Ye and Chang Shi Yi reconciled with Ma Yin, who gave them control of Chang Zhou and Xu Zhou. Yang Cheng Lu's younger brother, Yaj Txiam Nyeeb, was forced to concede his territory but was given control over Fei Zhou. Yaj Txiam Nyeeb divided his territory into 10 parts for his 10 sons to govern: Zheng Long, Zheng Yuan, Zheng Xiu, Zheng Yue, Zheng Kuan, Zheng Wan, Zheng Yan, Zheng Song, Zheng Quan, and Zheng Qin [44]. Yaj Txiam Nyeeb called his territory Shi Dong Shou Ling or Fei Shan Ling Gong. People of the Yang Clan become the diplomats of this territory [44]. Hmong people entered into a policy of self-rule but with recognition of Liao Emperor [44]."
    },
    {
      "date":{
        "era":1,
        "yr":960,
        "mm":0,
        "dd":0
      },
      "idx":121,
      "txt":"(960--1279) Song Chao (Xoom Tshoj)"
    },
    {
      "date":{
        "era":1,
        "yr":960,
        "mm":0,
        "dd":0
      },
      "idx":122,
      "txt":"(960--1126) Northern Song Chao (Beisong Chao) [46]."
    },
    {
      "date":{
        "era":1,
        "yr":960,
        "mm":0,
        "dd":0
      },
      "idx":123,
      "txt":"(960--1126) Southern Song Chao (Nansong Chao) [46]."
    },
    {
      "date":{
        "era":1,
        "yr":1038,
        "mm":0,
        "dd":0
      },
      "idx":124,
      "txt":"(1038--1227) Western Xia Chao (Xixia Chao) founded by Tanguts [47]."
    },
    {
      "date":{
        "era":1,
        "yr":1043,
        "mm":0,
        "dd":0
      },
      "idx":125,
      "txt":"Song Emperor began systematic sinicization of Hmong territories. Imperial troops are moved into Hmong territories under the pretext of help. Wars and bounty are declared against Hmong. Old boundaries are destroyed with the defeat of Hmong, and new ones are drawn to reflect Chinese dominance. Ethnic Han are also encouraged to take and live on former Hmong territories. Five Lakes Region was also a prime target for destruction and assimilation [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1081,
        "mm":0,
        "dd":0
      },
      "idx":126,
      "txt":"Hmong began revolt against Song Emperor led by Yang Sheng Tai (Yaj Seem Thaij) and retake Five Lakes Region. Song Emperor and his commanders began to realize the problem Hmong people would pose against their campaigns to dominate, and an official even recommended retreat. When commanders reported the futility of conquering such a place, the Song Emperor finally issued a stop to the wars [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1102,
        "mm":11,
        "dd":0
      },
      "idx":127,
      "txt":"Yang Guang Xing (Yaj Kua Xyeej) conceded to Song Emperor the name changes of territories in Five Lakes Region. Cheng Zhou was changed to Qing Zhou; Fei Zhou was changed to Shi Zhu [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1115,
        "mm":0,
        "dd":0
      },
      "idx":128,
      "txt":"(1115--1234) Jin Chao founded by the Jurchen [48]."
    },
    {
      "date":{
        "era":1,
        "yr":1130,
        "mm":0,
        "dd":0
      },
      "idx":129,
      "txt":"Song Emperor continued to restructure Hmong territory. Jing Zhou was created to administer over the Five Lakes Region. As the Song Dynasty began to weaken, it also levied heavy taxes against the Hmong people which included taking their crop productions [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1131,
        "mm":0,
        "dd":0
      },
      "idx":130,
      "txt":"Yaj Txiam Xeeb began revolt against Song Emperor at Ling Jang (today known as Ling Kou at Qing Xiang) [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1134,
        "mm":0,
        "dd":0
      },
      "idx":131,
      "txt":"Song forces led by Wu Xi defeated Yaj Txiam Xeeb [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1141,
        "mm":0,
        "dd":0
      },
      "idx":132,
      "txt":"Remnants of Yaj Txiam Xeeb's forces attacked Song troops at Wu Yang. Song emperor issued a cease fire. Yaj Ceem Ceeb along with 300 brought gold to Song Emperor; in exchange, the Song Emperor is recorded to 300 coins to the Hmong [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1145,
        "mm":0,
        "dd":0
      },
      "idx":133,
      "txt":"Other leaders, Yang Zheng Xiu and Yang Jing Yong, also came under Song emperor [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1154,
        "mm":3,
        "dd":0
      },
      "idx":134,
      "txt":"Yaj Txiam Xeeb led Hmong and Mien against Song Emperor again. Song Emperor respond by sending Li Dao to fight Yaj Txiam Xeeb [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1154,
        "mm":7,
        "dd":0
      },
      "idx":135,
      "txt":"Yaj Txiam Xeeb and his two sons, Yaj Tseem Xyaw and Yaj Tseem Koo, are defeated and killed. Their defeat was attributed to their small numbers [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1158,
        "mm":0,
        "dd":0
      },
      "idx":136,
      "txt":"Song Emperor began to include Hmong into official positions to prevent further uprisings. This policy seemed to have stopped the armed conflicts between the Song Emperor and Hmong [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1272,
        "mm":0,
        "dd":0
      },
      "idx":137,
      "txt":"(1271--1368) Yuan Chao (Yeej Tshoj) Hmong are classified as Cooked and Raw. The rapid cultural change of Hmong people began through the Cook Hmong between the Raw Hmong and Chinese [50]. Hmong in Funan were recorded trading with Arabs. Hmong began exporting goods with wood work and food ingredients [44]. The Yuan Dynasty classified the people of China into 4 classes from highest to lowest: Mongolians, Se Mu (western people), Han, and Naj Fab (southern people). The Naj Fab received the worst of treatment from the Mongolian rulers. When the Mongolians attacked the Naj Fab people, both Hmong and Chinese stood to fight [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1277,
        "mm":0,
        "dd":0
      },
      "idx":138,
      "txt":"A Hmong writing system called, Ntawv Puaj Txwm, is claimed to have been created [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1300,
        "mm":0,
        "dd":0
      },
      "idx":139,
      "txt":"What is known today as Guizhou was permanently made a part of China by the Yuan dynasty [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1346,
        "mm":0,
        "dd":0
      },
      "idx":140,
      "txt":"Wu Tian Ban (Vwj Theeb Pov) and Yang Liu Zong (Yaj Luj Txoov) rebelled against Yuan Emperor in Guizhou. The Yuan Emperor sent You Cheng Wei Yuan Shuai and Wang Zhe Ti Mu Er to stop the rebellion [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1347,
        "mm":2,
        "dd":0
      },
      "idx":141,
      "txt":"Wu Tian Ban attacked Ying Zhou [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1347,
        "mm":5,
        "dd":0
      },
      "idx":142,
      "txt":"Wu Tian Ban attacked and took Wu Gang. You Chen Sha Ban is sent by Yuan Emperor to retake Wu Gang [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1347,
        "mm":7,
        "dd":0
      },
      "idx":143,
      "txt":"Wu Tian Ban attacked Ying Zhou for a second time. He took the city of Xi Pu and Xyi Sheng Xi [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1347,
        "mm":9,
        "dd":0
      },
      "idx":144,
      "txt":"Wu Tian Ban attacked and took Wu Gang again. Wu Tian Ban also took Bao Qing (today's Shao Yang Shi) [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1347,
        "mm":10,
        "dd":0
      },
      "idx":145,
      "txt":"Wu Tian Ban attacked Ying Zhou for a third time. The Imperial troops fled without a fight [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1347,
        "mm":11,
        "dd":0
      },
      "idx":146,
      "txt":"Wu Tian Ban attacked and took Jing Zhou. They defend the city against numerous attacks [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1348,
        "mm":3,
        "dd":0
      },
      "idx":147,
      "txt":"Wu Tian Ban attacked Ying Zhou for a fourth time [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1348,
        "mm":11,
        "dd":0
      },
      "idx":148,
      "txt":"Wu Tian Ban took a major city in Guangxi province. Multiple cities, areas, and the Five Lakes Region come under Hmong control. Smaller ethnic groups from Guizhou and Guangxi provinces also join in on Wu Tian Ban's rebellion [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1349,
        "mm":3,
        "dd":0
      },
      "idx":149,
      "txt":"Wu Tian Ban attacked Ying Zhou for a fifth time. Wu Tian Ban's headquarter is destroyed. Yang Liu Zong is caught and killed [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1349,
        "mm":12,
        "dd":0
      },
      "idx":150,
      "txt":"Wu Tian Ban attacked and took Sheng Zhou (today's Yin Ling Xian). Wu Tian Ban also infiltrated Hubei and Funan. His control spread through Guangxi, Guizhou, Hubei, and Funan provinces. After his death, some of his men were led by Liu Fu Tong (Lwj Fuj Thoob) [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1368,
        "mm":0,
        "dd":0
      },
      "idx":151,
      "txt":"(1368--1644) Ming Chao (Meej Tshoj) Ming Dynasty began strict control of empire. In Hmong territories, taxes were raised and soldiers were sent out to guard and patrol key locations. Hmong crops were also taken by the government [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1371,
        "mm":0,
        "dd":0
      },
      "idx":152,
      "txt":"Hmong rebellion recorded in Xwm Leej but was quickly put down [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1405,
        "mm":2,
        "dd":28
      },
      "idx":153,
      "txt":"Hmong are referred to as Raw Hmong (Sheng Miao, Hmoob Nyoos) and Cooked Hmong (Shu Miao, Hmoob Siav) as recorded in the book Ming Shi Lu [50]."
    },
    {
      "date":{
        "era":1,
        "yr":1405,
        "mm":7,
        "dd":0
      },
      "idx":154,
      "txt":"Ming official named, Gong Neng, wrote to the Ming Emperor stating [50], \"A Raw Hmong leader named, Liao Biao, of 25 Hmong villages in Gang Zi Ping, with 453 house holds, have come under you.\" Guo ZiZhang reported in his book Qing Ji [50], \"The Hmong are descendants of the Jiuli and San Miao kingdoms. These Hmong have only first names, and belong to no clans; they lack ethnic identity and an emperor. The Hmong living on Chinese soil are called Cooked Hmong. They are used to collect taxes and work for Chinese officials; they think like the Chinese; therefore, the Chinese want them to be citizens. They resigned their fate to the Emperor. The ones that do not want to be Chinese people are called Raw Hmong. There are more Raw Hmong than Cooked Hmong.\" Lu Ci Yun wrote in his book Dong Xi Qian Zhi [50], \"The Cooked Hmong are closer. The Raw Hmong are farther. The Cooked Hmong's life toil like horses and ox, such that I cannot begin to describe.\" Feng Xiang Xing wrote in his book Miao Su Ji Wen [50], \"From Yuan Zhou to the West are mostly Hmong. There is more Hmong in Guizhou and Yunnan provinces. The Hmong have a differences along the lines of Cooked and Raw. The Raw Hmong lived in the wilderness. We have not seen the Raw Hmong. The Cooked Hmong raise taxes for the Emperor and work like the Chinese. We see the Cooked Hmong everywhere.\" Gong Zi's book Miao Min Kao [50], \"The Hmong who come under the Emperor are Cooked Hmong. They are not that much different from the Chinese. The Raw Hmong are the ones remote from our areas. We do not understand their words, and their beliefs are different.\""
    },
    {
      "date":{
        "era":1,
        "yr":1413,
        "mm":0,
        "dd":0
      },
      "idx":155,
      "txt":"Guizhou became a province of Imperial China under the Ming dynasty. Guizhou was described by both Chinese and western sources as a place of harsh environmental conditions and the people there as [16] \"distressingly poor.\""
    },
    {
      "date":{
        "era":1,
        "yr":1436,
        "mm":0,
        "dd":0
      },
      "idx":156,
      "txt":"Li Tian Bao rebelled. He took over a few zhou and provinces; Xing Ning (Xeeb Leej), Xwm Leej, Xeeb Huam (Xin Huan), Ceem Tsawb, and Hui Tong (Feem Thooj) [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1449,
        "mm":0,
        "dd":0
      },
      "idx":157,
      "txt":"Hmong take over territories in Guizhou from Li Ping (Lis Pheej) to Tian Zhu (Theeb Tswv) [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1450,
        "mm":11,
        "dd":0
      },
      "idx":158,
      "txt":"Relatives of the Ming Emperor, Hui Zha and Hui La, in Wu Gang, conspired to overthrow the emperor. They gather the Hmong from Meng Neng (Moob Neeb), Cheng Tian Zi (Tsheej Theeb Ntxwv), Yang Wen Bo (Yaj Veej Pov), and Jing Long Xi (Ceeb Looj Xyib). They are also joined by Hmong from Pu Ding (Phwv Tseem), Yong Ning (Yoos Leej), and Bi Ji (Pij Cij). The conspiracy would be revealed later and thwarted. Other conspiracies to overthrow the Ming Emperor are also discovered [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1450,
        "mm":12,
        "dd":0
      },
      "idx":159,
      "txt":"Ming Emperor ordered Wang Jing to take soldiers from Liang Qiang (Laj Chaj) to fight against Hmong. The Hmong stood their ground [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1452,
        "mm":7,
        "dd":0
      },
      "idx":160,
      "txt":"The Ming Emperor ordered Ma Jing and Cang Jiang Li Zheng to attack Hmong at Qing Fei Shan. Qing Fei Shan's defense was led by a Hmong named Yang Guang Qing (Yaj Kuab Cheej). Yang Guang Qing's defense is overwhelmed and 560 of his men including himself are taken captive [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1454,
        "mm":2,
        "dd":0
      },
      "idx":161,
      "txt":"Li Tian Bao won a major victory in Guizhou at Cheej Toob [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1454,
        "mm":9,
        "dd":0
      },
      "idx":162,
      "txt":"Li Tian Bao attacked Ming headquarter at Long Li [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1455,
        "mm":0,
        "dd":0
      },
      "idx":163,
      "txt":"Li Tian Bao, a Miao king, \"Martial and Majestic King,\" (Wulie Wang) rebelled in Guizhou [16]. Li Tian Bao is selected by Hmong as Emperor Wu Li, and the year is marked as the First Year of the Emperor Wu Li. Li Tian Bao's control is spread and his influence grew [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1455,
        "mm":2,
        "dd":0
      },
      "idx":164,
      "txt":"Meng Neng, one of the leaders with Li Tian Bao, is killed at Ping Xi Wei [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1460,
        "mm":0,
        "dd":0
      },
      "idx":165,
      "txt":"Li Tian Bao is captured and taken to be executed at Beijing [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1460,
        "mm":12,
        "dd":0
      },
      "idx":166,
      "txt":"Ming Emperor ordered more campaigns to exterminate Hmong [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1466,
        "mm":0,
        "dd":0
      },
      "idx":167,
      "txt":"Ming Emperor Cheng Hua reported in Tong Jiang Qang Mu San Pian [44], \"The Hmong of Wu Gang, Yeej Ceem, and Tong Gu have started to rebell. There is also problems in Guizhou.\""
    },
    {
      "date":{
        "era":1,
        "yr":1476,
        "mm":0,
        "dd":0
      },
      "idx":168,
      "txt":"Ming Emperor reported [44], \"Hmoob have began to create trouble in Wu Gang, Ceem Tsawb, and Funan. There is war again.\""
    },
    {
      "date":{
        "era":1,
        "yr":1501,
        "mm":0,
        "dd":0
      },
      "idx":169,
      "txt":"Lis Txawj Vam began rebellion in Xwm Leej and Tsheej Pum. They had a yellow flag. Lis Txawj Vam is selected as Emperor Li Tian Wang (Huabtais Theeb Vaj) by the Hmong. Emperor Li Tian Wang took redivided the land back to the citizens for cultivation. Li Tian Wang had popular support and many young men enlisted in his service. Li Tian Wang took over as many as 40 cities in Guangxi province [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1501,
        "mm":10,
        "dd":0
      },
      "idx":170,
      "txt":"Ming Emperor ordered Yan Zhong Yu and Xi Qi to attack Li Tian Wang. A total of 57,000 troops are gathered to attack the Hmong. The troops were split into major divisions for multi-prong attack. Troops were also sent to guard roads to block communications between the Hmong. More troops were also called as Ming troops were put into place. Hmong soldiers were using the natural advantages of the environment to defend their territories. In fear of Cooked Hmong cooperation with Raw Hmong, the Cooked Hmong were given fertilizers as a token of good faith; although the Chinese kept a close eye out on them. The outnumbered Hmong responded with the military strategy of \"Fast--Slow.\" The Fast--Slow strategy was as follows. Fast: When the enemy is small then attack. When the enemy is tired, the fight them in close quarters. When the enemy runs, then persue. Slow: When the enemy comes then hide. When the enemy rest, then harass. When the enemy is many, then use the environment as defense and to your advantage. Before the enemy attacks, set traps for him [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1501,
        "mm":11,
        "dd":0
      },
      "idx":171,
      "txt":"After a few setbacks, the Ming troops changed tactics against the Hmong. They resorted to use fire to smoke out Hmong and guns as first line of attacks. They also laid sieged on cities held by Hmong; when the Hmong exhausted the resources, then the Ming troops would move in to take over; 40 cities held by Hmong were taken over in this way. About 1,571 Hmong soldiers died; 400 Hmong women were tortured [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1501,
        "mm":12,
        "dd":0
      },
      "idx":172,
      "txt":"Li Tian Wang and 2,000 Hmong soldiers are caught and killed [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1504,
        "mm":0,
        "dd":0
      },
      "idx":173,
      "txt":"Hmong are forced to wear Chinese clothes [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1506,
        "mm":0,
        "dd":0
      },
      "idx":174,
      "txt":"Hmong led by Zheng Xi Huang Ji (Tseem Xyi Faj Ci) rebelled in Xwm Leej [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1526,
        "mm":0,
        "dd":0
      },
      "idx":175,
      "txt":"Li Zheng (Lis Tseem) and Duang Wen Jian (Tuam Veej Ceem) rebelled in Xwm Leej. They were defeated by Tong Chang (Thooj Tshav) and Wang Zhong (Vaj Tsoo) [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1551,
        "mm":0,
        "dd":0
      },
      "idx":176,
      "txt":"Qi Ting Xian (Chij Thee Xyam) and Xiao Zi Ling (Xyob Txiv Leej) led Hmong and Mien uprising in Xwm Leej. They were fought by Zhang Yue (Tsab Yuj), Zhang Yu (Tsab Yim) and He Jing (Huj Ceem) [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1553,
        "mm":0,
        "dd":0
      },
      "idx":177,
      "txt":"Qi Ting Xian is captured [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1615,
        "mm":0,
        "dd":0
      },
      "idx":178,
      "txt":"The Chinese created a minor 100 miles Great Wall in the west, from Baojing to Tongren, to block out the Hmongs. This wall was called the \"Southern Great Wall,\" and costed the Chinese 4,000 silver bars and much man power to build. 6--10,000 Chinese military personnel were used to oversee the Southern Great Wall [1]."
    },
    {
      "date":{
        "era":1,
        "yr":1643,
        "mm":0,
        "dd":0
      },
      "idx":179,
      "txt":"Zhang Xing Zhong (Tsab Xyeem Tsoob) led Hmong and Mien people to revolt in Funan [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1644,
        "mm":0,
        "dd":0
      },
      "idx":180,
      "txt":"(1644--1911) Qing ChaoDuring the Qing Dynasty (Cheeb Tshoj), the Hmongs and Chinese again entered into a period of intense fighting and wars [1]. When the Qing Dynasty came to power, the allowed Hmong people self-rule as long as they did not revolt. However, when the government was stable enough and obtained power, they reversed this policy [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1645,
        "mm":0,
        "dd":0
      },
      "idx":181,
      "txt":"Wu Sangui is given civil and military authority over Yunnan [51]."
    },
    {
      "date":{
        "era":1,
        "yr":1662,
        "mm":0,
        "dd":0
      },
      "idx":182,
      "txt":"Wu Sangui is given control over Guizhou [51]."
    },
    {
      "date":{
        "era":1,
        "yr":1670,
        "mm":0,
        "dd":0
      },
      "idx":183,
      "txt":"Wu Sangui gains considerable control over Hunan, Sichuan, Gansu and even Shaanxi [51]."
    },
    {
      "date":{
        "era":1,
        "yr":1674,
        "mm":0,
        "dd":0
      },
      "idx":184,
      "txt":"Wu Sangui 'rebelled' against Qing Dynasty, even though Qing had already lost control by this point. His actions initiates the Revolt of the Three Feudatories: Wu Sangui in Yunnan, Shang Kexi in Guangdong, and Geng Jingzhong in Fujian [51]."
    },
    {
      "date":{
        "era":1,
        "yr":1678,
        "mm":0,
        "dd":0
      },
      "idx":185,
      "txt":"Wu Sangui dies of natural causes [51]."
    },
    {
      "date":{
        "era":1,
        "yr":1681,
        "mm":0,
        "dd":0
      },
      "idx":186,
      "txt":"Rebel Chinese general Huang Ming took refuge in southeastern Guizhou. In his 20 years with the Miao, he trained them with military supplies and weapon left behind by Chinese general Ma Bao. Huang Ming's teaching of military technology led the Miao to develop and improve what they have acquired [1]."
    },
    {
      "date":{
        "era":1,
        "yr":1723,
        "mm":0,
        "dd":0
      },
      "idx":187,
      "txt":"Miao ethnography of Qing Dynasty begins with Miao Album (Miaoman Tu or Bai Miao Tu) compiled by officials governing frontier areas [52]."
    },
    {
      "date":{
        "era":1,
        "yr":1726,
        "mm":0,
        "dd":0
      },
      "idx":188,
      "txt":"Hmong territory began to be taken over by Qing Emperor. After observing Guizhou, E Er Tai wrote to the Qing Emperor a letter called Gai Tu Gui Liu stating the replacement of native officials with Qing officials. The Qing Emperor let it be known that the land was his and everything produced on his land belong to him and not the people. Native officials were replaced with new Qing administrations: Fu (Fwv), Zhou (Tsawb), Ting (Theeb), and Xian (Xyeem). In regions of Raw Hmong, war was brought to confiscate the land and positions of Tong Zhi (Thooj Tsib) would govern the area [44]. The regions with native officials were in Hu Guang province: San Zhi, Rong Mei, Yong Shun, Mao Gang, Cheng Zhou, and Hui Zhou. Also in Yun Gui province: Si Zhou, Si Nan, Bo Zhou, Shui Xi, Wu Meng, Zheng Xiong, Lin An, and Dong Chuan. Also in Sichuan province: Nan Yang, Lei Bu, Shi Ye, Ping Cha, Yi Mei, and Diu Ba. Also in Guangxi province: An Long, Xi Long Zhou, Shang Ling, Xi Ling Xian, and Si Cheng. From 1726 to 1736, all these cities were taken over by Qing officials [44]. The regions in Raw Hmong territory without native officials were in Xyab Xyib in Funan. Also in Qing Shui Jiang, Li Ping, Du Yun, Lei Gong, and Shan Qu in Guizhou. Also a few more places across Funan, Guizhou and Guangxi [44]. Qing soldiers were sent to patrol Hmong territories. They were responsible for farming to make their own living, and confiscated all good land away from Hmong. Taxes were also increased [44]. Many of the old Hmong leaders were still alive. There were 60 Zhang Guang Si (Tsab Kuas Xib) and many more Tu Si (Thwv Xib) still alive [44]."
    },
    {
      "date":{
        "era":1,
        "yr":1730,
        "mm":0,
        "dd":0
      },
      "idx":189,
      "txt":"Hmong began to rise up against Qing Dynasty. The Raw Hmong fought primarily to protect their territories. The Cooked Hmong fought to protect for equality [50]."
    },
    {
      "date":{
        "era":1,
        "yr":1735,
        "mm":0,
        "dd":0
      },
      "idx":190,
      "txt":"(1735--1738) In Southeast China, Guizhou, fighting between the Hmongs and Chinese erupted over farming and territorial disputes. 8 counties and 1,000 cities took part on the side of the Hmongs, and by the end of the war, 17,670 military men were killed, 13,000 were enslaved and 11,000 were imprisoned on the side of the Hmongs [1]."
    },
    {
      "date":{
        "era":1,
        "yr":1795,
        "mm":0,
        "dd":0
      },
      "idx":191,
      "txt":"(1795--1806) A period of intense fighting between the Hmongs and Chinese erupted near Guizhou, Hunnan and Sichuan. Wu Bayue, Shu Liaoting, Shu Sanbao and Hu Tianban were the Hmong leadership in this war. Wu Bayue was capture and killed as the Hmongs are again defeated [1]. Fighting occurred due to mass influx of poor Chinese looking for land into Hmong territory [53]. After defeat of Hmong, agricultural colonies were set up and the Hmong were placed under military discipline. Trade was also supervised by officials. Chinese education was introduced and Hmong were also forbidden to practice their religion, while at the same time, more Han settlers transgressed into Hmong territory [53]."
    },
    {
      "date":{
        "era":1,
        "yr":1800,
        "mm":0,
        "dd":0
      },
      "idx":192,
      "txt":"Hmongs began migration into northern Lao mountain area [43]."
    },
    {
      "date":{
        "era":1,
        "yr":1815,
        "mm":0,
        "dd":0
      },
      "idx":193,
      "txt":"Opium was the only cash crop in northern Laos for the Hmongs [43]."
    },
    {
      "date":{
        "era":1,
        "yr":1832,
        "mm":0,
        "dd":0
      },
      "idx":194,
      "txt":"The Miao tribes of Kuangsi and Hunan, led by a man who either received or adopted the title of the Golden Dragon, rebelled. The rebellion was due to dissatisfaction of the tribesmen with the glaring injustice they were suffering at the hands of the local authorities. After some initial massacres and reprisals, a general was sent to put an end to the outbreak; but so far from doing this, he seems to have come off second best in most of the battles which ensued, and was finally driven into Kuang-tung. For this he was superseded, and two Commissioners dispatched to take charge of further operations. It occurred to these officials that possibly persuasion might succeed where violence had failed; and accordingly a proclamation was widely circulated, promising pardon and redress of wrongs to all who would at once return to their allegiance, and pointing out at the same time the futility of further resistance. The effect of this move was magical; within a few days the rebellion was over [54]."
    },
    {
      "date":{
        "era":1,
        "yr":1839,
        "mm":0,
        "dd":0
      },
      "idx":195,
      "txt":"(1839--1842) The Opium War between Imperial China and Great Britain began. The Opium War and Treaty of Nanjing opened parts of China to the outside world, leading to Western encroachment that places China under semicolonial status [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1850,
        "mm":0,
        "dd":0
      },
      "idx":196,
      "txt":"Kaitong Lo PaSy and son, Lo BliaYao, brought Hmong followers out of China to escape persecution. Lo PaSy settled in Tonkin among the already well established Kaitong Ly NhiaVu and his people. Kaitong Lo PaSy would shortly relocate to Nong Het in Laos [11, 55]."
    },
    {
      "date":{
        "era":1,
        "yr":1851,
        "mm":0,
        "dd":0
      },
      "idx":197,
      "txt":"(1851--1864) The Taiping Rebellion against Imperial China began [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1851,
        "mm":0,
        "dd":0
      },
      "idx":198,
      "txt":"(1851--1868) In the Huaibei region, the Nian revolted against Imperial China [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1853,
        "mm":0,
        "dd":0
      },
      "idx":199,
      "txt":"Hu Linyi wrote about rebels in China: \"They die as bandits or they die from starvation, but they die, and that is all. If they break the law as bandits, they can postpone death; if they simply endure starvation, they will die forthwith.\" [16]"
    },
    {
      "date":{
        "era":1,
        "yr":1854,
        "mm":0,
        "dd":0
      },
      "idx":200,
      "txt":"(1854--1873) The Maio rebellion took place in Guizhou against Imperial China. In the 20 years struggle, the population of 7 million Miao suffered 4.9 million deaths. The Miao rebellion was not believed to be the result of the sole Miao insurgency and ethnic hostility. Many minority ethnicities, the Hans and Muslims included, were involved in the rebellion in Guizhou. The rebellion composed of 49% Han, 40% Miao and 11% Muslim. This rebellion was termed the Miao rebellion by Imperial China because the Miao were involved with virtually all uprisings and remained the foundation for the rebellion [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1854,
        "mm":0,
        "dd":0
      },
      "idx":201,
      "txt":"Zhang Xiumei led the Hmongs against the Chinese. He is captured and executed in Hunnan. His dying words are for the Hmongs to never give up their homeland and assimilate under the Chinese, and he also promised to return to help the Hmongs. Betrayal is believed to be the ultimate deciding factor in the defeat of the Hmongs [1]."
    },
    {
      "date":{
        "era":1,
        "yr":1854,
        "mm":3,
        "dd":25
      },
      "idx":202,
      "txt":"Yang Yuanbao, a Bouyei, started a rebellion at Fengning. This revolt started a chain reaction of insurgency in Guizhou [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1854,
        "mm":5,
        "dd":18
      },
      "idx":203,
      "txt":"Yang Yuanbao was captured by the Chinese at Xilishan, Guangxi, and sent to Guiyang for execution [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1854,
        "mm":9,
        "dd":27
      },
      "idx":204,
      "txt":"Yang Longxi, another Bouyei, seized control of Tongzi city, and continued insurgency fever by using slogans successfully to rally troops [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1855,
        "mm":0,
        "dd":0
      },
      "idx":205,
      "txt":"(1855--1864) In Yunnan, Muslims rebelled against Imperial China [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1855,
        "mm":4,
        "dd":22
      },
      "idx":206,
      "txt":"Yang Longxi was killed near Gezhuangsi by direct military efforts of Chinese Han Chao. Miao on the side of Han Chao observed the frailty of Qing troops [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1855,
        "mm":4,
        "dd":30
      },
      "idx":207,
      "txt":"Miao took the Tiagong subprefrectural seat. Han Chao was commissioned to resolve the uprising. The Miao demanded a stop to taxes and return of all land occupied by Chinese belonging to the Miao [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1855,
        "mm":8,
        "dd":1
      },
      "idx":208,
      "txt":"Lo Guangming and Lo Tianming, Miaos from the Bazhai-Danjian area, led Miao rebellion [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1855,
        "mm":9,
        "dd":9
      },
      "idx":209,
      "txt":"Lo Guangming, with inside collaborator of Dujiang magistrate, Yu Zhengji, took Dujiang [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1855,
        "mm":10,
        "dd":24
      },
      "idx":210,
      "txt":"Miao rebels took Danjiang after a 3 months seige [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1855,
        "mm":11,
        "dd":1
      },
      "idx":211,
      "txt":"Boyei, Zou Shengbao, the former lieutenant of Yang Longxi, started his own rebellion at Tongzi-Suiyang border [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1855,
        "mm":11,
        "dd":11
      },
      "idx":212,
      "txt":"Red Signals (Honghao) seized prefectural seat of Tongren in rebellion of taxes and property. The leaders of this rebellion were Xu Tingje and Mei Jiding from Shangwudong. They were aided/manipulated by religious sect leaders (Wu Laogu, Chen Fulin, Xu Xing) who were described as having powerful magic to transform ordinary people into martial arts experts/practioners with just water [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1855,
        "mm":11,
        "dd":16
      },
      "idx":213,
      "txt":"Miao took the walled garrsion town of Datang [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1855,
        "mm":11,
        "dd":22
      },
      "idx":214,
      "txt":"Miao took the departmental seat of Luohu [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1855,
        "mm":12,
        "dd":6
      },
      "idx":215,
      "txt":"Lo Guangming took the subprefectural Xiajiang and controlled it for 7 years to come [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1855,
        "mm":12,
        "dd":10
      },
      "idx":216,
      "txt":"Lo Guangming took the subprefectural Bazhai and controlled it for 16 years to come [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1856,
        "mm":0,
        "dd":0
      },
      "idx":217,
      "txt":"Kaitong Ly NhiaVu relocated from Tonkin to Nong Het [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1856,
        "mm":0,
        "dd":0
      },
      "idx":218,
      "txt":"(1856--1860) The Arrow War took place over four years as the Qing dynasty was continually challenged by foreign 'barbarians' [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1856,
        "mm":2,
        "dd":1
      },
      "idx":219,
      "txt":"Religious sect leaders of Red Singals were killed [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1856,
        "mm":2,
        "dd":17
      },
      "idx":220,
      "txt":"Brigade-General Tong Panmei captured Datang and claimed the killing of 4,000-5,000 rebels and capturing 6,000-7,000 rebels [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1856,
        "mm":3,
        "dd":25
      },
      "idx":221,
      "txt":"Chinese Xiaoshung took Luohu [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1856,
        "mm":6,
        "dd":1
      },
      "idx":222,
      "txt":"Miao troops sent back from helping Chinese troops against Taiping rebels. Miao troops rebelled with Sanbao as their base and Long Caigui as their leader, and joined Yu Zhengji to take Guzhou [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1856,
        "mm":8,
        "dd":4
      },
      "idx":223,
      "txt":"Miao troops took walled towns of Shengbing and Kaili. At Kaili, Chinese beseiged within the city walls resorted to cannibalism to survive [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1856,
        "mm":8,
        "dd":23
      },
      "idx":224,
      "txt":"Yu Zhengji and Long Caigui took Guzhou. Chinese cannibalism at Guizhou is reported [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1856,
        "mm":8,
        "dd":30
      },
      "idx":225,
      "txt":"Lo Guangming takes prefectural Duyun. Chinese cannibalism at Guizhou is reported [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1856,
        "mm":9,
        "dd":11
      },
      "idx":226,
      "txt":"Miao took the subprefectural Qingjiang and controlled the area until 1869 [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1856,
        "mm":9,
        "dd":27
      },
      "idx":227,
      "txt":"Miao took the subprefectural Taigong and controlled the area until 1870 [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1856,
        "mm":11,
        "dd":0
      },
      "idx":228,
      "txt":"November, Chinese retook Duyun [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1856,
        "mm":12,
        "dd":0
      },
      "idx":229,
      "txt":"December, Remnants of Red Signals are wiped out by Chinese [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1857,
        "mm":2,
        "dd":24
      },
      "idx":230,
      "txt":"Xiaoshun,Chinese commander-in-chief of Guizhou, committed suicide over desperate situation in Dushan. Between 1857 and 1867, there was a transition of 10 commanders-in-chief [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1857,
        "mm":10,
        "dd":0
      },
      "idx":231,
      "txt":"October, Jiang Yingfang, a master martial artist Miao and leader of the Heavenly Peace sect, rebelled [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1858,
        "mm":1,
        "dd":0
      },
      "idx":232,
      "txt":"January, He Kuanyi led the White Signals (Baihao) to rebel in northern Guizhou. They took Yingwuxi. [16]"
    },
    {
      "date":{
        "era":1,
        "yr":1858,
        "mm":2,
        "dd":2
      },
      "idx":233,
      "txt":"He Kuanyi took Yingjiang [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1858,
        "mm":3,
        "dd":0
      },
      "idx":234,
      "txt":"March, Yellow Signals began their uprising: Yang Hefeng at Yuxi, He Jipan at Zhuoshui and Hu Heier at Ganxi. A Miao, Her Desheng (He Desheng) was the most capable military leader involved in the Yellow Signal. [16]"
    },
    {
      "date":{
        "era":1,
        "yr":1858,
        "mm":3,
        "dd":3
      },
      "idx":235,
      "txt":"Lo Guangming took Maha and the Miao controlled it until 1868. With Maha taken, the southeastern region of Guizhou, the heartland of the Miao, is protected by all the Miao controlled periphery cities [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1858,
        "mm":10,
        "dd":5
      },
      "idx":236,
      "txt":"Miao took Zhengyaun [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1860,
        "mm":0,
        "dd":0
      },
      "idx":237,
      "txt":"Xiong Tai declared himself 'Lord of the Sky' [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1862,
        "mm":0,
        "dd":0
      },
      "idx":238,
      "txt":"Xiong Tai started rebellion in Tonkin. Xiong Tai is recorded as a 'madman'. His followers were composed of predominantly White Hmong, and he was met with opposition by some Black Hmong. His palace was called, 'Long Vei', Seat of the Dragon, and located at the mountain of Tang Chang [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1862,
        "mm":5,
        "dd":25
      },
      "idx":239,
      "txt":"Jiang Yingfang took the administrative seat of Tianzhu. He became known as King Pacifier (wang pingding). Three months later, Hunan troops retook Tianzhu, captured Jiang Yingfang in October and executed him [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1864,
        "mm":0,
        "dd":0
      },
      "idx":240,
      "txt":"Taiping rebellion in China was resolved. This rebellion freed up resources for China to deal with Miao rebellion [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1864,
        "mm":0,
        "dd":0
      },
      "idx":241,
      "txt":"French annexation of Cochin China (southern Vietnam) and position of protectorate over Cambodia began [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1865,
        "mm":0,
        "dd":0
      },
      "idx":242,
      "txt":"(Summer) 1865, 10,000 Miao deaths were reported in the Dading prefecture from illness, war and diseases [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1865,
        "mm":0,
        "dd":0
      },
      "idx":243,
      "txt":"Liu Yuezhao, Sichuan-backed, is charged to lead Chinese against Miao rebellions in northern Guizhou. [16]"
    },
    {
      "date":{
        "era":1,
        "yr":1866,
        "mm":0,
        "dd":0
      },
      "idx":244,
      "txt":"Tang Joing, a Qing commander, began to incorporate captured Miao rebels into his army against uncaptured Miao rebels [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1866,
        "mm":0,
        "dd":0
      },
      "idx":245,
      "txt":"Liu Yuezhao was governor of Yunnan and Guizhou (1868) [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1866,
        "mm":0,
        "dd":0
      },
      "idx":246,
      "txt":"(Spring), Liu Yuezhao took Suiyang from rebel leader Wu Yuanbiao and his 4,000 troops and 6,000 inhabitants of Suiyang [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1866,
        "mm":0,
        "dd":0
      },
      "idx":247,
      "txt":"Zhaochen was appointed by Hunan to lead Hunan troops in Guizhou against Miao. Three columns of Hunan forces were to be used against the Miao. The first of 5,000 men, lead by Zhaochen was based in Zhenyuan. The second, 4,000 men under Li Yuandu in Tongren. The third, 10,000 men under Zhou Hongyin at Tianzhu. This force of Hunan soilders were to pacify systematically rebel forces in eastern Guizhou. Some of the techniques used by the Chinese military leaders included strong troop discipline (no rape, looting, murdering) and empowering natives as officials so as to both hold the conquered areas and prevent further uprisings [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1867,
        "mm":0,
        "dd":0
      },
      "idx":248,
      "txt":"April, Commander Doudart de Lagree and Francis Granier charted Mekong for France utilization in trade and expedition. Charting the Mekong led to Laos [11, 55]."
    },
    {
      "date":{
        "era":1,
        "yr":1867,
        "mm":6,
        "dd":0
      },
      "idx":249,
      "txt":"June, Cen Yuying took Thao Xingchun's Bije and Zhenxiong bases [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1867,
        "mm":11,
        "dd":0
      },
      "idx":250,
      "txt":"November, Zhaochen was impeached by Hunan governor for ineffective column approach to extinguishing Miao rebellion [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1868,
        "mm":0,
        "dd":0
      },
      "idx":251,
      "txt":"(Autumn), Tang Jiong acquired British merchant-adventurer Williman Mensy as a military consultant. [16]"
    },
    {
      "date":{
        "era":1,
        "yr":1868,
        "mm":1,
        "dd":0
      },
      "idx":252,
      "txt":"January, Xi Baotian was appointed by the govenor of Hunan to take Zhaochen's command over Hunan troops against the Miao rebels. He had 10,000 new troops with this assignment. By the end of January, Xi Baotian and Li Yuandi took Jingzhuyuan and defeated the Yellow and White Signals [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1868,
        "mm":4,
        "dd":0
      },
      "idx":253,
      "txt":"April, Sichuan sent 6,900 troops with Tiang Jiong to aid Guizhou against Miao rebels [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1868,
        "mm":5,
        "dd":0
      },
      "idx":254,
      "txt":"May, Tiang Jiong and Li Yuandu took White Signal stronghold at Biandaoshui. 7,000 rebels surrendered as 1,000 rebels were killed. Miao bases at Zhenyuan, Qingjian and Shibing were also captured. [16]"
    },
    {
      "date":{
        "era":1,
        "yr":1868,
        "mm":8,
        "dd":0
      },
      "idx":255,
      "txt":"August, White and Yellow Singal bases at Jiaolinsi, Yuhuashan, Da Jiaodingshang, Xao Jiaodingshang and Shangdaping were all captured. During this campaign, all significant White and Yellow Signal leaders were captured or killed. Northeastern Guizhou was pacified by the Chinese Hunan-Sichuan troops. Success of Chinese commander Tang Jiong was credited to his ability to incorporate and use captured Han and Miao rebels to fight on his side--albeit, Han and Sichuan troops never harmoniously cooperated against the rebels. With the Chinese victory over Han Signals, the focus turned on the Miao in the southeast, and to take the stronghold of Taigong [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1869,
        "mm":4,
        "dd":0
      },
      "idx":256,
      "txt":"April, Miao leader Bao Dadu ambushed and killed half of Huang Runchuang's troops including Huang (a subordinate of Xi Baotian) [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1869,
        "mm":8,
        "dd":0
      },
      "idx":257,
      "txt":"August, Miao leader Jin Gan'gan took Duyun and acquired high-technology weapons from Chinese troops [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1870,
        "mm":0,
        "dd":0
      },
      "idx":258,
      "txt":"Tang Jiong was dismissed by Sichuan. Zhou Dawu replaced Tang Jiong and led with an additional Sichuan 5,900 new troops [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1870,
        "mm":8,
        "dd":0
      },
      "idx":259,
      "txt":"August, Tang Jiong withdrew his troops from advancement after his repeated failed attempts to have military supplies replenished [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1870,
        "mm":11,
        "dd":12
      },
      "idx":260,
      "txt":"Xi Baotian captured strategic Miao town, Taigong, and Miao resistance began to crumble [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1870,
        "mm":12,
        "dd":0
      },
      "idx":261,
      "txt":"December, Miao leader, Yan Dawu, was captured [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1872,
        "mm":0,
        "dd":0
      },
      "idx":262,
      "txt":"Zhang Xiumei, great Miao leader of rebellion, was captured [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1872,
        "mm":5,
        "dd":28
      },
      "idx":263,
      "txt":"Gao Her was captured at Leigongshan and executed [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1872,
        "mm":5,
        "dd":31
      },
      "idx":264,
      "txt":"The Hui in southwest Guizhou were pacified as Xingyi was taken by the Chinese [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1873,
        "mm":0,
        "dd":0
      },
      "idx":265,
      "txt":"Chinese declared the official end of Miao rebellion. Reconstruction began as Miao are forced to assimilate into Chinese culture through requirements such as wearing only Chinese clothing, studying only Confucian thoughts, speaking only Chinese, etc… An estimated 4.9 million out of 7 million people were killed in the Miao rebellion. Property of 25,000,000 taels of silver was additionally lost to Guizhou, while 80,000,000 taels of silver were spent in pacifying the Miao rebellion [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1873,
        "mm":0,
        "dd":0
      },
      "idx":266,
      "txt":"Francis Granier beheaded Black Flag bandits in Tonkin [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1875,
        "mm":0,
        "dd":0
      },
      "idx":267,
      "txt":"Xiong Tai is killed by Chinese assassins hired by his father-in-law after killing his wife. One of Xiong Tai's adopted son, Ly Tsan Tsao, replaced Xiong Tai as ruler at Yen Minh. Ly Tsan Tsao would be defeated and moved to Meo Vac; Ly Tsan Tsao would be killed at Xin Cai while leading attacks against enemies coming from China [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1884,
        "mm":0,
        "dd":0
      },
      "idx":268,
      "txt":"French annexation of Tonkin (north Vietnam) and Annam (middle Vietnam) [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1884,
        "mm":0,
        "dd":0
      },
      "idx":269,
      "txt":"(1884--1885) Sino-French War Its underlying cause was the French desire for control of the Red River, which linked Hanoi to the resource-wealthy Yunnan province in China."
    },
    {
      "date":{
        "era":1,
        "yr":1886,
        "mm":0,
        "dd":0
      },
      "idx":270,
      "txt":"Xiong Mi Chang is born at Si Phai in Tonkin [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1887,
        "mm":0,
        "dd":0
      },
      "idx":271,
      "txt":"France gained control of Kingdom of Luang Prabang from Siam. Auguste Paive is said to rescue King Unkham from burning palace during invasion by White Tai invasion, lead by Deo Van Tri [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1888,
        "mm":0,
        "dd":0
      },
      "idx":272,
      "txt":"Ly Foung was born to Ly Dra Pao, his father, in the Nong Het area [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1893,
        "mm":0,
        "dd":0
      },
      "idx":273,
      "txt":"France assumed rule over Laos with 'gunboat policy' [11, 55]."
    },
    {
      "date":{
        "era":1,
        "yr":1896,
        "mm":0,
        "dd":0
      },
      "idx":274,
      "txt":"During this time, Hmongs in northern Laos suffered taxation by the French imperialists and Laotion middlemen. The 3 Kiatong Hmongs in the Nong Het area organized an ambush against the much despised Laotion middlemen tax collectors. As a result, French-Hmong negotiations began and a new political structure of Hmong villages results. Under the new political structure, the position of Tasseng (canton administrator) had two important authority: 1) collect taxes from their own people and 2) autonomy over Hmong village administration. Efficacy of Tasseng power and authority forever changed Hmong preference for dealing with Westerners over Laotions [56]. More precise reason for revolt was French colonial authority allowed tax payment in opium that was far below market value. Franco-Lao authority sent 'garde indigne' to intimidate Hmong, which was attacked by Hmong forces at Ban Khang Phanieng. The Hmong even attacked the capital of Xieng Khouang, forcing the French to call for an armistice and negotiations [11]. Another one of Xiong Tai's adopted son, Ly Tsan Pao, attempted to maintain leadership in his name. Due to ineffectiveness, however, Xiong Tai's movement came to an end [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1899,
        "mm":0,
        "dd":0
      },
      "idx":275,
      "txt":"Boxer Rebellion."
    },
    {
      "date":{
        "era":1,
        "yr":1899,
        "mm":0,
        "dd":0
      },
      "idx":276,
      "txt":"It was estimated by French that Hmong made up 30% of the population in Xieng Khouang province in Laos. [11]"
    },
    {
      "date":{
        "era":1,
        "yr":1900,
        "mm":0,
        "dd":0
      },
      "idx":277,
      "txt":"Lo PaSy was killed by his bodyguard, Zong Cher Yang, and was buried at Yeng Pha [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1902,
        "mm":0,
        "dd":0
      },
      "idx":278,
      "txt":"Opium is one third of all French colonial revenues [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1904,
        "mm":0,
        "dd":0
      },
      "idx":279,
      "txt":"Paid French staff administering Laos is recorded at 72 and said to be the 'smallest anywhere in the French empire.' [11]"
    },
    {
      "date":{
        "era":1,
        "yr":1904,
        "mm":0,
        "dd":0
      },
      "idx":280,
      "txt":"Hmong, led by Ly clan, of Nong Khaiw rose up in protest against tax extortions by Lao officials. Lao officials charged 4 kips for each individual, while the French charged only 1 kip per individual. When Hmong refused to pay the taxes, the French formed armed response. The Hmong also took up arms and were led by Ly Tsong Na. Ly Tsong Na's group is recorded to kill 70--80 people at Cha Pha Ngoi. The French immediately called for peace, and the Hmong sent a representative from the Moua clan who was nominated by the French as Tasseng. Ly NhiaVu relocated to Long Hu, while Ly Tsong Na stayed. Ly Tsong Na was killed by Ly Joua Kao, who was promised by the French to be promoted to kaitong if he eliminated Ly Tsong Na. Ly Joua Kao would later be poisoned by French who also denied the existence of the deal [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1906,
        "mm":0,
        "dd":0
      },
      "idx":281,
      "txt":"A Hmong writing system based on Chinese character system was discovered (1906--1909) [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1910,
        "mm":0,
        "dd":0
      },
      "idx":282,
      "txt":"Lo BliaYao volunteered to help aid French construct Colonial Route 7. Corvee constriptions of Hmong began. [11]"
    },
    {
      "date":{
        "era":1,
        "yr":1910,
        "mm":0,
        "dd":0
      },
      "idx":283,
      "txt":"Ly Foung became secretary of Lo BliaYao [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1910,
        "mm":0,
        "dd":0
      },
      "idx":284,
      "txt":"(1910--1912) Xiong Mi Chang started rebellion in northeastern Tonkin at Haigiang province. His leadership is legitimized by the support of Ly Tsan Pao [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1910,
        "mm":9,
        "dd":17
      },
      "idx":285,
      "txt":"French officer, Lieutenant Leonard, stationed at Dong Van, reported a Hmong madman at Meo Vac stirring and attracting public attention. Leonard reported that people denied of an uprising or manifestation of a Hmong king. Xiong Mi Chang accompanied Lt. Leonard back to Dong Van as a token of good intention. Xiong Mi Chang is held for nearly 3 months [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1910,
        "mm":12,
        "dd":28
      },
      "idx":286,
      "txt":"Xiong Mi Chang is released from French detention."
    },
    {
      "date":{
        "era":1,
        "yr":1911,
        "mm":0,
        "dd":0
      },
      "idx":287,
      "txt":"Zhong Hua Min Guo (Meej Kuj)"
    },
    {
      "date":{
        "era":1,
        "yr":1911,
        "mm":2,
        "dd":9
      },
      "idx":288,
      "txt":"As reported by Tai authority, Xiong Mi Chang proclaimed himself as 'king of the mountains' and has 600-700 armed followers. The construction of trenches and conscription is recorded [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1911,
        "mm":2,
        "dd":11
      },
      "idx":289,
      "txt":"Lt. Leonard investigated Tai claims about Xiong Mi Chang at Nga-Ban-Sui. He observed 400 Hmong with their hair flowing down and armed. Lt. Leonard asked them their grievances, and they responded they no longer wanted to be under the rule of Tho chiefs, although they did not specify who they wanted to be ruled under [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1911,
        "mm":2,
        "dd":12
      },
      "idx":290,
      "txt":"Xiong Mi Chang and followers are reported to kill a Yao [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1911,
        "mm":2,
        "dd":15
      },
      "idx":291,
      "txt":"Xiong Mi Chang is recorded to hand out titles to followers, and also recorded constructing military and civil administration for his kingdom [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1911,
        "mm":2,
        "dd":25
      },
      "idx":292,
      "txt":"Xiong Mi Chang followers constructed a trench at Chang Poung. Hmong from China are recorded to arrive in Tonkin to participate in rebellion. Xiong Mi Kay, related to Xiong Mi Chang and who would also become his secretary for his literacy in Chinese, arrived from China [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1911,
        "mm":2,
        "dd":26
      },
      "idx":293,
      "txt":"Xiong Mi Chang's generals, Xiong Chinh Minh and Vang Van Sinh, led groups of 200 and 800 simultaneously attacking Tho village of Vinh Thon and market of Mo Rue, respectively. Other groups attacked at San Co Ping and Lung Cam. Former Chinese posts at Ma-lin and Hou-ting also attaked [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1911,
        "mm":2,
        "dd":27
      },
      "idx":294,
      "txt":"French prepared military response to Xiong Mi Chang rebellion with 1 company of Tokinense tirailleurs and one section of Legionnaires. French also convened with loyalist Hmong at Dong Van [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1911,
        "mm":2,
        "dd":28
      },
      "idx":295,
      "txt":"Hmong rebels attacked Yen Minh and were repelled by French Sergent Alessandri. Vang Van Sinh and Vang Seu led Hmong of Duong Thuong attacked Muong Cha and Black Hmong of Lung Chung [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1911,
        "mm":3,
        "dd":0
      },
      "idx":296,
      "txt":"French Captain Cot started peace settlement negotiations with Xiong Mi Chang at Meo Vac, the administrative capital of the king. Xiong Mi Chang is reported by locals as living in the mountains. Without meeting Xiong Mi Chang, the French asked the locals to send a message to Xiong Mi Chang promising safety if he surrendered. [11]"
    },
    {
      "date":{
        "era":1,
        "yr":1911,
        "mm":3,
        "dd":3
      },
      "idx":297,
      "txt":"Hmong rebels cross over from Tonkin into China and attacked at Ma Chang and Ma Leu [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1911,
        "mm":3,
        "dd":21
      },
      "idx":298,
      "txt":"Xiong Mi Chang's emissary returned without a response [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1911,
        "mm":3,
        "dd":22
      },
      "idx":299,
      "txt":"Captain Cot sought and found Xiong Mi Chang's hideout. Captain Cot captures Xiong Mi Chang's father, mother, and sister [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1911,
        "mm":4,
        "dd":10
      },
      "idx":300,
      "txt":"Xiong Mi Chang's rebellion effectively ended. Casualties suffered were 90, 52 of whom were Hmong, and 29 of whom were Tho. Xiong Mi Chang is reported to be taking refuge in Na Sin in China [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1911,
        "mm":7,
        "dd":0
      },
      "idx":301,
      "txt":"Xiong Mi Chang gained White Hmong followers while in China and prepare for new attacks [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1911,
        "mm":8,
        "dd":2
      },
      "idx":302,
      "txt":"Xiong Mi Chang attacked Ma Chan in China [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1911,
        "mm":8,
        "dd":9
      },
      "idx":303,
      "txt":"Xiong Mi Chang returned to his birthplace in Tonkin at Si Phai. More activity reported in Meo Vac following Xiong Mi Chang's return [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1911,
        "mm":8,
        "dd":15
      },
      "idx":304,
      "txt":"Chinese proposed to French a joint attack against Xiong Mi Chang in both Chinese (Ma Chan) and French (Dong Van) territories. The French rejected the offer and were convinced negotiations were useless at this point. More troops were called upon by French to end rebellion [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1911,
        "mm":9,
        "dd":11
      },
      "idx":305,
      "txt":"French loyalist chiefs from Chang and Vang clans were sent to assess and negotiate Xiong Mi Chang's surrender [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1911,
        "mm":9,
        "dd":16
      },
      "idx":306,
      "txt":"Chinese fail to capture Xiong Mi Chang at Ma Lin [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1911,
        "mm":10,
        "dd":4
      },
      "idx":307,
      "txt":"A group of 300 Hmong rebels attack Chinese at Ma Lin. They later fled into Tonkin with the Chinese persuing [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1911,
        "mm":12,
        "dd":0
      },
      "idx":308,
      "txt":"Hmong from Dong Van crossed into China with Chinese permission to ambush Xiong Mi Chang. Xiong Mi Chang's two wives and infant son died in this fight. Xiong Mi Chang's son was considered 'true king', and after his death, the rebellion grew ever more weak [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1912,
        "mm":0,
        "dd":0
      },
      "idx":309,
      "txt":"A French officer named d'Ollone documented the use of Chinese character logographic writing with some modifications/additions for a Hmong dialect in Sichuan [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1912,
        "mm":0,
        "dd":0
      },
      "idx":310,
      "txt":"Sun Yat Sen"
    },
    {
      "date":{
        "era":1,
        "yr":1912,
        "mm":1,
        "dd":0
      },
      "idx":311,
      "txt":"Xiong Mi Kay was captured and decapitated by Chinese. Xiong Mi Chang sent surrender letter to authorities at Dong Van. The French only promised to spare Xiong Mi Chang's life [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1912,
        "mm":4,
        "dd":22
      },
      "idx":312,
      "txt":"Xiong Mi Chang is captured after informant told of his nightly visits to his relatives at Ma Pang. Colonel Bonifacy, Commander of the Third Military Region, led a Peace Tribunal to interrogate Xiong Mi Chang. [11]"
    },
    {
      "date":{
        "era":1,
        "yr":1913,
        "mm":5,
        "dd":2
      },
      "idx":313,
      "txt":"Xiong Mi Chang is sentenced to work at l'Ile de la Table by the Governor General of Indochina. [11]"
    },
    {
      "date":{
        "era":1,
        "yr":1914,
        "mm":0,
        "dd":0
      },
      "idx":314,
      "txt":"Lo BliaYao is noted to have 15 crates of silver and gold, which he showed to a French military officer offering to buy his horse for 400 piastres [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1914,
        "mm":1,
        "dd":0
      },
      "idx":315,
      "txt":"Xiong Mi Chang arrived at l'Ile de la Table [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1914,
        "mm":2,
        "dd":0
      },
      "idx":316,
      "txt":"Xiong Mi Chang is brought back to Quang Yen [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1916,
        "mm":0,
        "dd":0
      },
      "idx":317,
      "txt":"(1912--1916) Yuan Shikai"
    },
    {
      "date":{
        "era":1,
        "yr":1917,
        "mm":0,
        "dd":0
      },
      "idx":318,
      "txt":"Savina Romanized Alphabet for Hmong language was created (before 1917) [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1918,
        "mm":0,
        "dd":0
      },
      "idx":319,
      "txt":"(1918--1921) Pa Chay Vue's Chao Fa (Prince of the Sky) battled with the French. Paj Chai's Chao Fa originally were a military movement against the Black Thai of Northwest Vietnam. However, when the French were notified of a 'rebellion' against the French, French troops were sent after the Chao Fa. This military mobilization organized against the Chao Fa was the largest military expedition up to this point in Laos [56]. The rebellion led by Pa Chay was called 'La Guerre du Fou' (the War of the Madman) and also known as the Madman's Rebellion or Pa Chay's War [11]. The French characterize Pa Chay as an epileptic and sorcerer [11]. The rebellion started in Tonkin near Dien Bien Phu [11]. 1920: Pa Chay's Chao Fa are first recorded to go against French [55]. 11/17/1921: Pa Chay was assassinated by the Khmu at Paj Chay's hideout in Muoug Hep, Luang Prabang. At Nong Het, the French staged a bloody show by decapitating the heads of Chao Fa leaders in front of a forced Hmong crowd. Futhermore, the Hmongs were forced by the French to pay a total of 375 kilograms of silver in compensation for every Laotion or Vietnamese killed in the Chao Fa war. The French were not the only ones to gain from this war, Hmong allies of the French who helped to subdue the Chao Fa also gained, namely, Lo Blia Yao [56]."
    },
    {
      "date":{
        "era":1,
        "yr":1918,
        "mm":0,
        "dd":0
      },
      "idx":320,
      "txt":"Ly Foung abducted and married Lo BliaYao's daughter."
    },
    {
      "date":{
        "era":1,
        "yr":1918,
        "mm":1,
        "dd":0
      },
      "idx":321,
      "txt":"On the Chinese frontier at Muong Tinh, a Hmong man announced a miraculous recovery after paralysis for several years. He was arrested by the local Chinese official in fear of this miracle inspiring a rebellion. When Hmong leaders failed to petition for his release, they gathered a force to attack but the Chinese official had already abandoned his post [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1918,
        "mm":2,
        "dd":8
      },
      "idx":322,
      "txt":"Hmong rebels capture Dong Xuong. The Chinese eventually pushed the Hmong into Tonkin. In Tokin, Hmong Chinese and Hmong Tokinese joined forces and declared independence [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1918,
        "mm":6,
        "dd":11
      },
      "idx":323,
      "txt":"Arrival of Hmong king heard in Thuan district [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1918,
        "mm":6,
        "dd":17
      },
      "idx":324,
      "txt":"Hmong attacked Tai in Muong Dong region [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1918,
        "mm":10,
        "dd":30
      },
      "idx":325,
      "txt":"Pa Chay led Hmong at Dien Bien Phu in revolt [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1918,
        "mm":11,
        "dd":11
      },
      "idx":326,
      "txt":"Two Hmong chiefs involved in rebellion captured by French [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1918,
        "mm":12,
        "dd":5
      },
      "idx":327,
      "txt":"French delegation sent to negotiate with Pa Chay ambushed [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1918,
        "mm":12,
        "dd":12
      },
      "idx":328,
      "txt":"Pa Chay troops attacked Ban Nam Ngham and secured the area as a refuge for their families. [11]"
    },
    {
      "date":{
        "era":1,
        "yr":1918,
        "mm":12,
        "dd":14
      },
      "idx":329,
      "txt":"Hmong inspired by Pa Chay burned the village of Le Pe in Lao Cai province [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1918,
        "mm":12,
        "dd":27
      },
      "idx":330,
      "txt":"Pa Chay was reported to be taking refuge at Long He with Cam Xu, a self-proclaimed king [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1918,
        "mm":12,
        "dd":30
      },
      "idx":331,
      "txt":"Hmong attacked Bien Lieu [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1919,
        "mm":1,
        "dd":2
      },
      "idx":332,
      "txt":"Gautier attacked Hmong at Ban Pu Veng, killing 20 Hmong. Gautier started to move towards Long He. [11]"
    },
    {
      "date":{
        "era":1,
        "yr":1919,
        "mm":1,
        "dd":19
      },
      "idx":333,
      "txt":"Gautier reached Long He and forced Cam Xu and Pa Chay in different directions [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1919,
        "mm":7,
        "dd":0
      },
      "idx":334,
      "txt":"Pa Chay entered into Xieng Khouang province in Laos to recruit more followers [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1919,
        "mm":9,
        "dd":12
      },
      "idx":335,
      "txt":"Followers of Pa Chay preemptively attacked French commissioner of Luang Prabang, Barrelle, who was en route to attack the Hmong [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1919,
        "mm":11,
        "dd":5
      },
      "idx":336,
      "txt":"Hmong overran French post at Luang Prabang [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1919,
        "mm":11,
        "dd":14
      },
      "idx":337,
      "txt":"French Commandant Dorey ordered a ban on exportation of rice and livestock [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1920,
        "mm":0,
        "dd":0
      },
      "idx":338,
      "txt":"(1920--1935) Lo BliaYao, son of King Lo PaSy, began leadership of Hmongs as Tasseng [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1920,
        "mm":0,
        "dd":0
      },
      "idx":339,
      "txt":"In China, Red Miao encroached on Black Miao homeland in eastern Guizhou. The government of China stepped in and removed the Red Miao from Black Miao territory [16]."
    },
    {
      "date":{
        "era":1,
        "yr":1920,
        "mm":0,
        "dd":0
      },
      "idx":340,
      "txt":"Nong Het region boasted 30,000 Hmong [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1920,
        "mm":1,
        "dd":0
      },
      "idx":341,
      "txt":"After a failed assassination by Lo Shong Ger, Lo BliaYao returned from Vietnam with French forces led by Henri Roux [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1920,
        "mm":3,
        "dd":0
      },
      "idx":342,
      "txt":"Lo BliaYao achieved victory against Hmong rebels. He sentenced rebels to imprisonment, executions, and fines. Lo Shong Ger and those who escaped are lured back. Long Shong Ger was sent to Xieng Khoaung and died en route ingesting poison; his followers were publicly executed at Nong Het. All three sons of Long Shong Ger, Chai Vang, Soua Ger, and Toua Zeng, were also publicly executed [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1920,
        "mm":12,
        "dd":19
      },
      "idx":343,
      "txt":"Commandant Dorey resumes chase after Pa Chay [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1920,
        "mm":12,
        "dd":20
      },
      "idx":344,
      "txt":"Commandant Dorey launched two-pronged attack to take Sung Quan Lao Van. Captain Limousine attacked between Nam Heup and Nam Bong, while Captain Pesquidous attacked east of Nam Bong. Cpt. Pesquidous encountered Hmong attack two kilometers from Phya Cham. Dorey ordered Hmong poppy fields to be burned along with the rest of the village. Dorey also approved for animals to be slaughtered as provision for the colonial troops, and ordered the systematic evacuation of villages [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1920,
        "mm":12,
        "dd":24
      },
      "idx":345,
      "txt":"Cpt. Pesquidous overpowered Hmong and forced them to Phya Cham, where another battle ensued called, 'Affairs of Phya Cham'. The French eventually broke through Hmong defenses and the Hmong fled [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1920,
        "mm":12,
        "dd":26
      },
      "idx":346,
      "txt":"Cpt. Pesquidous took control of Lao Yang Lao Tso and Tian Tao [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1920,
        "mm":12,
        "dd":28
      },
      "idx":347,
      "txt":"Cpt. Pesquidous destroyed Lao Mang and Lao Ly [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1920,
        "mm":12,
        "dd":29
      },
      "idx":348,
      "txt":"Cpt. Pesquidous began take over of Ba Lac and Sac Phya [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1920,
        "mm":12,
        "dd":30
      },
      "idx":349,
      "txt":"Cpt. Limousine reached and took Phu Nhi with negligible attacks by Hmong [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1921,
        "mm":1,
        "dd":4
      },
      "idx":350,
      "txt":"The last two villages leading to Sung Quan Lao Van, Ta Deng and Ban Chie, were taken by French troops [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1921,
        "mm":1,
        "dd":6
      },
      "idx":351,
      "txt":"Hmong chief, Song Quan Sung, declared allegiance to French and was accepted. Losing battles and Hmong alliances with French marked the turning point for Pa Chay [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1921,
        "mm":1,
        "dd":9
      },
      "idx":352,
      "txt":"Cpt. Limousine and Cpt. Pesquidous troops joined to attack Sung Quan Lao Van [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1921,
        "mm":1,
        "dd":11
      },
      "idx":353,
      "txt":"French took Sung Quan Lao Van [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1921,
        "mm":1,
        "dd":12
      },
      "idx":354,
      "txt":"Cpt. Pesquidous was ordered to stay while Cpt. Limousine pursued Hmong rebels toward Muong Heup. [11]"
    },
    {
      "date":{
        "era":1,
        "yr":1921,
        "mm":3,
        "dd":0
      },
      "idx":355,
      "txt":"Madman's Rebellion ended [11]. French created 8 tasseng positions to be held by Hmong after rebellion. Tassengs were allowed to submit taxes directly to French bypassing naikong. French also planned to create schools to educate sons of Hmong chiefs [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1921,
        "mm":3,
        "dd":21
      },
      "idx":356,
      "txt":"French forces sent to quell rebellion return back to former posts [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1922,
        "mm":0,
        "dd":0
      },
      "idx":357,
      "txt":"Pollard script for Flowery Miao is used to publish Gospel of Mark [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1922,
        "mm":11,
        "dd":22
      },
      "idx":358,
      "txt":"Pa Chay is killed by bounty hunters [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1924,
        "mm":0,
        "dd":0
      },
      "idx":359,
      "txt":"Construction of Colonial Route 7 was finished [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1924,
        "mm":0,
        "dd":0
      },
      "idx":360,
      "txt":"Ly Foung resigns from secretary position with Lo Blia Yao [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1924,
        "mm":0,
        "dd":0
      },
      "idx":361,
      "txt":"Ly Foung petitioned French on behalf of Green Hmong for their own tasseng position. Nong Het is split into Phak Boun and Keng Khoai, with Joua Kao Ku and Lo Blia Yao as the respective tassengs. Ly Foung became secretary of Joua Kao Ku [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1924,
        "mm":0,
        "dd":0
      },
      "idx":362,
      "txt":"Lo Blia Yao protested the split of Nong Het by alleging Ly Foung was the architect behind uprising in the War of the Madman, a murderer, and planning to oust Joua Kao Ku of the tasseng position for himself. [11]"
    },
    {
      "date":{
        "era":1,
        "yr":1925,
        "mm":0,
        "dd":0
      },
      "idx":363,
      "txt":"Tsong Tou Lo, son of Lo BliaYao, took over his father's position as tasseng [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1925,
        "mm":12,
        "dd":0
      },
      "idx":364,
      "txt":"French investigated Ly Foung's involvement with the death of Lia Nao Vang [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1926,
        "mm":0,
        "dd":0
      },
      "idx":365,
      "txt":"Ly Foung presented himself in front of French Commissioner Barthelemy in Xieng Khouang to address charges made by Lo Blia Yao. He was set free and offered an apology when none of the charges were found valid [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1928,
        "mm":0,
        "dd":0
      },
      "idx":366,
      "txt":"Chiang Kai-Shek"
    },
    {
      "date":{
        "era":1,
        "yr":1929,
        "mm":0,
        "dd":0
      },
      "idx":367,
      "txt":"Ly Foung became tasseng over Phak Boun [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1929,
        "mm":0,
        "dd":0
      },
      "idx":368,
      "txt":"Shong Lue Yang (Soob Lwj Yaj) was born as Shoua Yang [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1930,
        "mm":0,
        "dd":0
      },
      "idx":369,
      "txt":"Ho Chi Minh attended Communist International Conference in Hong Kong that united Indochina into Communist Party of Indochina [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1932,
        "mm":0,
        "dd":0
      },
      "idx":370,
      "txt":"A Vietnamese missionary, C. K. Trung, publishes the Gospel of Mark in Hmong Leng in Thailand using Thai characters; the alphabet is known as Trung Alphabet [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1934,
        "mm":0,
        "dd":0
      },
      "idx":371,
      "txt":"Touby LyFoung graduated from primary school and started to attend middle school at Lycee Pavie in Vientiane [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1935,
        "mm":0,
        "dd":0
      },
      "idx":372,
      "txt":"Ly Foung began his domination over Nong Het politics after Lo BliaYao's death. His son Ly Nao Chao became the tasseng of Phak Boun, while Ly Foung became tasseng of Keng Khoai [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1935,
        "mm":1,
        "dd":2
      },
      "idx":373,
      "txt":"Lo BliaYao died. It is mentioned he left 700 silver bars behind [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1936,
        "mm":0,
        "dd":0
      },
      "idx":374,
      "txt":"PaGe LyFoung was appointed naikong of Nong Het [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1938,
        "mm":0,
        "dd":0
      },
      "idx":375,
      "txt":"Lyfoung Touby was appointed Tasseng. Phay Dang, son of Lo Blia Yao, became bitter rival and enemy of Lyfong Touby and Lyfong's future alliances and endeavours [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1939,
        "mm":0,
        "dd":0
      },
      "idx":376,
      "txt":"Phay Dang Lo had appealed unsuccessfully to the local Lao administrator in Muong Kham, French Commissar in Xieng Khouang and the Viceroy Prince Phetsarath in Luang Prabang for the title of Tasseng. Phang Dang even presented his father's, Lo Blia Yao, rhinoceros horns to the Viceroy in his appeal. The Viceroy, although assuring Phang Dang of Tasseng, failed to come through for him by being overly occupied with the Lao Issara Movement (Free Lao) from French control [55, 56]."
    },
    {
      "date":{
        "era":1,
        "yr":1939,
        "mm":0,
        "dd":0
      },
      "idx":377,
      "txt":"First school for Hmong created by French in Nong Het [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1939,
        "mm":0,
        "dd":0
      },
      "idx":378,
      "txt":"The Homer-Dixon Romanized Alphabet was created for a dialect in Vietnam which closely resembles Hmong Leng. [49]"
    },
    {
      "date":{
        "era":1,
        "yr":1939,
        "mm":10,
        "dd":0
      },
      "idx":379,
      "txt":"Ly Foung died from horse accident [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1940,
        "mm":0,
        "dd":0
      },
      "idx":380,
      "txt":"As France surrendered to Nazi Germany, Japan began the takeover of French Indochina [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1940,
        "mm":0,
        "dd":0
      },
      "idx":381,
      "txt":"Vichy government in communist France ordered colonies to not interfere with Japanese activities [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1941,
        "mm":5,
        "dd":0
      },
      "idx":382,
      "txt":"Lao King Sisavangvong gave Xieng Khouang to Touby LyFoung to rule over as an autonomous zone. Touby LyFoung rejected offer [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1941,
        "mm":8,
        "dd":29
      },
      "idx":383,
      "txt":"Xieng Khouang, Houei Sai and Vientiane were turned over to Kingdom of Laung Prabang by the Japanese, casting aside Chao Sia Kham [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1944,
        "mm":0,
        "dd":0
      },
      "idx":384,
      "txt":"British-backed French commandos sent to Xieng Khouang to gather intelligence and train indigenous resistance to the Japanese. This mission was known as Force 136. Ultimate mission of these French commandos were to secure PDJ for allied airborne invasion of Indochina. Muarice Gauthier recruited core leadership of Hmong consisting of Lyfong Touby, Lyfong Tou Geu and Moua Chia Xang [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1945,
        "mm":0,
        "dd":0
      },
      "idx":385,
      "txt":"After President Roosevelt's death, Truman becomes president."
    },
    {
      "date":{
        "era":1,
        "yr":1945,
        "mm":0,
        "dd":0
      },
      "idx":386,
      "txt":"Gauthier recruited Moua Chong Toua from Phou Duu [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1945,
        "mm":0,
        "dd":0
      },
      "idx":387,
      "txt":"During Japanese invasion of Southeast Asia, Phang Dang sided with the Japanese against Touby Lyfoung and the French [56]."
    },
    {
      "date":{
        "era":1,
        "yr":1945,
        "mm":0,
        "dd":0
      },
      "idx":388,
      "txt":"Mao Zedong 1945--1976"
    },
    {
      "date":{
        "era":1,
        "yr":1945,
        "mm":2,
        "dd":0
      },
      "idx":389,
      "txt":"February, Yalta Conference. American declared to Stalin it will not assist French in returning to Indochina [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1945,
        "mm":3,
        "dd":9
      },
      "idx":390,
      "txt":"Japanese launched coup de main against French installations throughout Indochina successfully [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1945,
        "mm":3,
        "dd":24
      },
      "idx":391,
      "txt":"300 Japanese soldiers reached Nong Het. Thirty Japanese soldiers remain at Nong Het while 270 move to Plain of Jars [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1945,
        "mm":4,
        "dd":8
      },
      "idx":392,
      "txt":"Lao king joined Laos to Japan's Co-Prosperity Sphere [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1945,
        "mm":5,
        "dd":0
      },
      "idx":393,
      "txt":"With the aid of Fay Dang Lo, Japanese began hunt for French soldiers who were aided by Touby LyFoung [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1945,
        "mm":8,
        "dd":15
      },
      "idx":394,
      "txt":"Japanese withdrew from Southeast Asia [56]."
    },
    {
      "date":{
        "era":1,
        "yr":1945,
        "mm":9,
        "dd":1
      },
      "idx":395,
      "txt":"Lao Prince Pethsarath declared Laos as a single independent kingdom [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1945,
        "mm":9,
        "dd":2
      },
      "idx":396,
      "txt":"September, Ho Chi Minh proclaimed the Democratic Republic of Vietnam [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1945,
        "mm":10,
        "dd":0
      },
      "idx":397,
      "txt":"October, Chao Souphanouvong arrived with Viet Minh in Laos to receive Command In Chief title. The Military Conventions was established, allowing Viet Minh control of Laos military [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1945,
        "mm":10,
        "dd":12
      },
      "idx":398,
      "txt":"Free Lao Movement formed Lao Issara to promote total independence from France [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1945,
        "mm":11,
        "dd":0
      },
      "idx":399,
      "txt":"November, Xieng Khoua was taken by Lao Issara after Japanese evacuation of Southeast Asia [56]."
    },
    {
      "date":{
        "era":1,
        "yr":1945,
        "mm":11,
        "dd":22
      },
      "idx":400,
      "txt":"Lyfong Touby's stone house is attacked by Viet Minh and Xieng Khouang was lost to Viet Minh. [55]"
    },
    {
      "date":{
        "era":1,
        "yr":1946,
        "mm":0,
        "dd":0
      },
      "idx":401,
      "txt":"Nationalist Chinese sent to disarm Japanese withdraw [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1946,
        "mm":0,
        "dd":0
      },
      "idx":402,
      "txt":"Chao Souphanouvong, disillusioned by partial independence, created the precursor group to Pathet Lao [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1946,
        "mm":1,
        "dd":0
      },
      "idx":403,
      "txt":"January, Hmong forces was also backed by Lao forces headed by Tiao Saykhan, a member of the Xieng Khoua Royal family [56]."
    },
    {
      "date":{
        "era":1,
        "yr":1946,
        "mm":1,
        "dd":26
      },
      "idx":404,
      "txt":"Gauthier and Lyfong Touby launched an attack to retake Xieng Khouang from Lao Issara. The operation was successful. Chao Sai Kham and Lyfong Touby received the French Legion of Honor. Chong Toua, Moua Chia Xang and every clan leader received Croix de Guerre. Progress was made as Hmongs earned government offices [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1946,
        "mm":3,
        "dd":0
      },
      "idx":405,
      "txt":"March, French reoccupation reentered Laos. Taxation of Hmongs by French is 7 kip per househould per year and a house tax of 5 bee. Taxations destroyed Hmong families as children were sold for 14 kip per child. Such taxations fueld Viet Minh propaganda and anti-French momentum."
    },
    {
      "date":{
        "era":1,
        "yr":1946,
        "mm":8,
        "dd":0
      },
      "idx":406,
      "txt":"Viet Minh established Resistance Committee of Eastern Laos in Hmong homelands. The penetration into Hmong villages ensured reoccupation and control by the Viet Minh [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1946,
        "mm":8,
        "dd":0
      },
      "idx":407,
      "txt":"Chao Savang Vatthana signed modus vivendi to provide Franco-Lao commission to study future of Franco-Lao relationship [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1946,
        "mm":9,
        "dd":0
      },
      "idx":408,
      "txt":"King Sisavang Vong of Laung Prabang appointed Touby Lyfoung to the position of Chao Muong (County Governor) for his support and relative success against NVA troops. Lyfoung's partner, Tiao Saykham, was made Provincial Governor or Chao Khoueng [11, 56]."
    },
    {
      "date":{
        "era":1,
        "yr":1946,
        "mm":12,
        "dd":0
      },
      "idx":409,
      "txt":"December, voters of Laos elected 44 delegates who granted Laos partial independence from France. Gauthier resigned from French military [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1947,
        "mm":0,
        "dd":0
      },
      "idx":410,
      "txt":"Meo Maquis, Hmongs organized by the French to fight against the Viet Minh began [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1947,
        "mm":0,
        "dd":0
      },
      "idx":411,
      "txt":"Gauthier returned to France [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1947,
        "mm":0,
        "dd":0
      },
      "idx":412,
      "txt":"Touby LyFoung is knighted as Phaya Damrong Ritthikay, The Lord Whose Name is Heard From Far Away [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1947,
        "mm":0,
        "dd":0
      },
      "idx":413,
      "txt":"Tougeu LyFoung is appointed as an advisor on the King's Council in Vientiane [11]."
    },
    {
      "date":{
        "era":1,
        "yr":1947,
        "mm":5,
        "dd":11
      },
      "idx":414,
      "txt":"Laos became an independent state within the French Union through a constitution drafted by elected delegates and King Sisavang Vong [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1947,
        "mm":12,
        "dd":0
      },
      "idx":415,
      "txt":"December, George Kennan of the State Department published his theory on \"containment of communism\" which became US policy used in South East Asia [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1949,
        "mm":0,
        "dd":0
      },
      "idx":416,
      "txt":"Laos beccame a UN member under efforts by Chao Sisouk na Champassak as the ambassador to the UN. [55]"
    },
    {
      "date":{
        "era":1,
        "yr":1949,
        "mm":7,
        "dd":0
      },
      "idx":417,
      "txt":"July, King Sisavang Vong introduced new Laos flag of three elephants [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1949,
        "mm":10,
        "dd":1
      },
      "idx":418,
      "txt":"Mao Zedong overtook Beijing and began communist rule [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1949,
        "mm":11,
        "dd":0
      },
      "idx":419,
      "txt":"Lao Issara dissolved, but Chao Souphanouvong continued with members of the group as Pathet Lao, claiming successor to Free Lao [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1950,
        "mm":1,
        "dd":14
      },
      "idx":420,
      "txt":"Ho gained recognition for communist Vietnam from China, the Soviet Union and US [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1950,
        "mm":6,
        "dd":25
      },
      "idx":421,
      "txt":"June, N. Korea invaded S. Korea. Under UN auspices, US troops were sent to Korea [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1950,
        "mm":6,
        "dd":29
      },
      "idx":422,
      "txt":"The first US supplies arrive in Saigon to aid the French against General Giap's Chinese-backed Viet Minh [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1950,
        "mm":8,
        "dd":0
      },
      "idx":423,
      "txt":"Neo Lao Issara (Free Lao Front) was formed. Phay Dang Lo was a minister within this organization representing minorities [56]."
    },
    {
      "date":{
        "era":1,
        "yr":1951,
        "mm":0,
        "dd":0
      },
      "idx":424,
      "txt":"(1951--1953) The Romanized Popular Alphabet (RPA) for Hmong Der and Leng languages is created by W. A. Smalley, G. L. Barney, and Y. Bertrais in Laos [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1952,
        "mm":0,
        "dd":0
      },
      "idx":425,
      "txt":"French's first employment of then unranked Vang Pao is recorded [55]. Vang Pao's grandfather was Paj Maim Vaj. His father was Neej Tswb Vaj. His siblings, in order of oldest to youngest, were Mov Vaj (Niam Nyiaj Teev Yaj, f), Txiab Vaj (Niam Paj Xauv Thoj, f), Yeeb Vaj (Niam Nplia Tub Vwj, f), Nom Tub Vaj, Niam Neej Tswb Thoj (f), Pov Vaj, Paj Vws, Niam Tsav Ntxawg Yaj (f), Niam Xov Txais Yaj (f), Niam Lis Teeb (f)."
    },
    {
      "date":{
        "era":1,
        "yr":1952,
        "mm":0,
        "dd":0
      },
      "idx":426,
      "txt":"Dwight D. Eisenhower is elected President."
    },
    {
      "date":{
        "era":1,
        "yr":1952,
        "mm":3,
        "dd":0
      },
      "idx":427,
      "txt":"March, Vang Pao received officer's strip from King Sisavang Vong [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1952,
        "mm":11,
        "dd":0
      },
      "idx":428,
      "txt":"November, Viet Minh occupied Dien Bien Phu and launched offensive from there against Laung Prabang. These battles resulted in a Hmong migration from Laun Prabang to Nong Het, seeking Lyfong Touby's protection. [55]"
    },
    {
      "date":{
        "era":1,
        "yr":1953,
        "mm":0,
        "dd":0
      },
      "idx":429,
      "txt":"Ho declared stalemate of Korean War as proof of inable US force, and used this example as an impetus for his liberation efforts [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1953,
        "mm":0,
        "dd":0
      },
      "idx":430,
      "txt":"Lt. General Henri Navarre was French commander-in-chief in Indochina [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1953,
        "mm":0,
        "dd":0
      },
      "idx":431,
      "txt":"Viet Minh invaded Hmong homeland in northern Laos [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1953,
        "mm":0,
        "dd":0
      },
      "idx":432,
      "txt":"France granted full independence to the Kingdom of Laos as a member of the French Union [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1953,
        "mm":7,
        "dd":27
      },
      "idx":433,
      "txt":"Korean War ended. Korea is divided at the 38th parallel as before the war [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1953,
        "mm":10,
        "dd":0
      },
      "idx":434,
      "txt":"October, Captain Jean Sassi, a French commando trained by Force 136 under assignment of Groupe de Commandos Mixtes Aeroportes, began the training of Meo Maquis to fight against Viet Minh [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1953,
        "mm":11,
        "dd":0
      },
      "idx":435,
      "txt":"November, French paratroopers retake Dien Bien Phu to deny Viet Minh of a strategic attack headquarters against Laos. Dien Bien Phu was nicknamed Hedgehog for its heavily armed might [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1954,
        "mm":1,
        "dd":0
      },
      "idx":436,
      "txt":"January, Viet Minh sieged the French at Dien Bien Phu [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1954,
        "mm":3,
        "dd":13
      },
      "idx":437,
      "txt":"General Giap's 50,000 troops began to attack at Dien Bien Phu and began to turn Hedgehog into Chamber Pot [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1954,
        "mm":4,
        "dd":16
      },
      "idx":438,
      "txt":"Captain Sassi begins Operation D, a mission for Meo Maquis to attack and harass Viet Minh from the back in an effort to stop the advancing Viet Minh on Chamber Pot. With odds mounting, Operation D is renamed Operation Desperate [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1954,
        "mm":5,
        "dd":7
      },
      "idx":439,
      "txt":"DBP fell to General Giap's troop. 2,000 French Expeditionary Corps solider lay dead and 12,000 prisoners were taken from DBP by the Viet Minh. Captain Sassi renamed Operation Desperate to Operation Deception because of the lack of French support [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1954,
        "mm":5,
        "dd":8
      },
      "idx":440,
      "txt":"Geneva Conference established cease fire between France and Ho's Viet Minh. North and South Vietnam are divided at the 17th parallel and Laos was established as a neutral, sovereign state. International Control Commission was created to monitor cease-fire violations [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1954,
        "mm":6,
        "dd":0
      },
      "idx":441,
      "txt":"June, US serious support began with ammunition supply [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1954,
        "mm":9,
        "dd":0
      },
      "idx":442,
      "txt":"September, Southeast Asia Treaty Organization (SEATO) [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1955,
        "mm":0,
        "dd":0
      },
      "idx":443,
      "txt":"Captain Jean Sassi and French forces left Indochina for good [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1955,
        "mm":0,
        "dd":0
      },
      "idx":444,
      "txt":"Vang Pao became the commander of all Hmong forces in upper Laos [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1955,
        "mm":0,
        "dd":0
      },
      "idx":445,
      "txt":"Programs Evaluation Office (PEO) began for US-backed Royal Lao Army to cope with Pathet Lao. US military advisors provided covert training to Lao Army through Program Evaluation Office (PEO) [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1956,
        "mm":0,
        "dd":0
      },
      "idx":446,
      "txt":"Chao Souvanna Phouma becomes Laos prime minister [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1956,
        "mm":0,
        "dd":0
      },
      "idx":447,
      "txt":"Neo Lao Issara was changed to Neo Lao Hak Sat (NLHS) or the Patriotic Front. Phay Dang Lo was the vice-president of this new organization [56]."
    },
    {
      "date":{
        "era":1,
        "yr":1956,
        "mm":0,
        "dd":0
      },
      "idx":448,
      "txt":"Vietnamese Romanized Alphabet is created for Hmong Der dialect [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1957,
        "mm":0,
        "dd":0
      },
      "idx":449,
      "txt":"Chinese Romanized Alphabet was created for Hmong by People's Republic of China [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1958,
        "mm":0,
        "dd":0
      },
      "idx":450,
      "txt":"Lao Coalition Government is formed by the Royal Lao Government and NLHS. Souvanna Phouma was the elected leader. Lo Foung was the Hmong representative for the NLHS side and Lyfoung Touby was the Hmong representative for the RLG side [56]."
    },
    {
      "date":{
        "era":1,
        "yr":1958,
        "mm":0,
        "dd":0
      },
      "idx":451,
      "txt":"Months after the Lao Coalition Government elections, Phoui Sananakone overthrew the newly formed government and instituted a rightists rule. Virtually all NLHS, except Phay Dang Lo, were incarcerated by Sananakone's government [56]."
    },
    {
      "date":{
        "era":1,
        "yr":1959,
        "mm":5,
        "dd":15
      },
      "idx":452,
      "txt":"Shong Lue Yang started creation of Pahawh Hmong [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1959,
        "mm":7,
        "dd":2
      },
      "idx":453,
      "txt":"Ho traveled to Moscow to seek Soviet aid from Premier Nikita Khurshchev [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1959,
        "mm":9,
        "dd":15
      },
      "idx":454,
      "txt":"Shong Lue Yang began to teach Pahawh Hmong and Pahawh Khmu in Tham Ha [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1960,
        "mm":0,
        "dd":0
      },
      "idx":455,
      "txt":"JFK was elected President."
    },
    {
      "date":{
        "era":1,
        "yr":1960,
        "mm":0,
        "dd":0
      },
      "idx":456,
      "txt":"CIA was recorded to have contacted Vang Pao and gain his military support against NVA. CIA promised supply of arms, training, food and an end to communist rule in exchange for Vang Pao's allegiance [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1960,
        "mm":0,
        "dd":0
      },
      "idx":457,
      "txt":"Vang Pao becomes Lt. Colonel in the Royal Lao Army after a successful coup detat, which he held General Amkha for his soldier's backpay from General Phoumi Nosavan [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1960,
        "mm":0,
        "dd":0
      },
      "idx":458,
      "txt":"Chao Fa's current leader was Yang Shong Lue (Yaj Soob Lwj), who called himself, Niam Ntawv or Nhia Daow (Mother of Letters), to represent his ability to create Hmong alpahbets [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1960,
        "mm":4,
        "dd":0
      },
      "idx":459,
      "txt":"April, Election ousted Souvanna Phouma and brought in a pro-American, anticommunist government. Moua Chia Xang, campaigning for a National Assembly seat is assassinated. Lyfong Touby and racist Laotians are among the accused conspirators of the assasination [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1960,
        "mm":5,
        "dd":0
      },
      "idx":460,
      "txt":"May, Souvanna Phouma and Pathet Lao leaders escaped prison. Supposedly an arranged escaped by Royal Lao to avoid political trial [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1960,
        "mm":8,
        "dd":9
      },
      "idx":461,
      "txt":"August, Kong Le overthrew American-backed government, returning power to Souvanna Phouma [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1960,
        "mm":9,
        "dd":28
      },
      "idx":462,
      "txt":"Sam Neua fell from Royal Lao to NVA and Pathet Lao [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1960,
        "mm":10,
        "dd":0
      },
      "idx":463,
      "txt":"October, NVA and Pathet Lao troops took Ban Ban and other cites along Route 7 [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1960,
        "mm":10,
        "dd":13
      },
      "idx":464,
      "txt":"Prime Minister Souvana Phouma asked and received military assistance from the Soviet for his Neutralist government [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1960,
        "mm":12,
        "dd":0
      },
      "idx":465,
      "txt":"December, Tasseng Yang at Khan Kho received Colonel Billy and Thai Colonel Khouphan. Colonel Billy's mission was to locate Vang Pao and assess the potential and desire of Hmongs to fight NVA and Pathet Lao. Vang Pao is located and contacted by Colonel Billy. US provided military support at Padong for Vang Pao [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1960,
        "mm":12,
        "dd":9
      },
      "idx":466,
      "txt":"Souvanna Phouma exiled himself to Cambodia [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1960,
        "mm":12,
        "dd":10
      },
      "idx":467,
      "txt":"Quinim Pholsena, a minister of Souvanna Phouma, bargained with Soviets to arm and supply those fighting General Phoumi under the condition that Kong Le and Pathet Lao form an alliance [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1960,
        "mm":12,
        "dd":13
      },
      "idx":468,
      "txt":"General Phoumi launched countercoup against Kong Le. Kong Le retreated to PDJ [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1960,
        "mm":12,
        "dd":30
      },
      "idx":469,
      "txt":"NVA successfully overtook General Phoumi's troops on Route 7 near Ban Ban [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1960,
        "mm":12,
        "dd":31
      },
      "idx":470,
      "txt":"Neutralists and communists began fight against General Phoumi at PDJ [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1961,
        "mm":0,
        "dd":0
      },
      "idx":471,
      "txt":"May, Geneva Conferences on Laos open under assumption of cease-fire [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1961,
        "mm":0,
        "dd":0
      },
      "idx":472,
      "txt":"In the late 1960's, the Pathet Lao Alphabet writing system was created for Hmong people [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1961,
        "mm":0,
        "dd":0
      },
      "idx":473,
      "txt":"In the late 1960's, the Whitelock Thai-based Alphabet writing system for the Hmong language was created [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1961,
        "mm":1,
        "dd":6
      },
      "idx":474,
      "txt":"Krushchev declared Soviet support for wars of national liberation in the face of incoming President Kennedy [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1961,
        "mm":3,
        "dd":9
      },
      "idx":475,
      "txt":"Kong Le, Pathet Lao and NVA stopped General Phoumi's attempt to retake PDJ. PDJ battles against Hmong and Royal Lao by the NVA , Kong Le and Pathet Lao broke out [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1961,
        "mm":4,
        "dd":17
      },
      "idx":476,
      "txt":"Bay of Pigs Invasion failed. Kennedy ordered covert White Star advisors in Laos to operate overtly in a counter-Khrushchev move. This action violated the Geneva Accords openly [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1961,
        "mm":6,
        "dd":5
      },
      "idx":477,
      "txt":"Summit in Vienna between Kennedy and Khrushchev [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1962,
        "mm":0,
        "dd":0
      },
      "idx":478,
      "txt":"North Vietnam denied the presence of NVA troops in Laos and did not withdrew any forces, while Americans withdrew 666 military men. By the end of August, there were 10,000 NVA in Laos [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1962,
        "mm":0,
        "dd":0
      },
      "idx":479,
      "txt":"US realized the threat of NVA presence in Laos and resorted to the Third Option--which is counterinsurgency and guerrilla warfare. Vang Pao moved his headquarter from Pha Khao to Long Chieng [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1962,
        "mm":6,
        "dd":23
      },
      "idx":480,
      "txt":"US pulled out White Star advisors to show good faith in Geneva Conference [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1962,
        "mm":7,
        "dd":23
      },
      "idx":481,
      "txt":"July, Geneva Accords reaffirmed Laos as a neutral state and prohibited foreign bases or troops. Kennedy negotiators in Geneva stated a Laos based on coalition government would emerge. General Phoumi would have to step down and Chao Souvanna Phouma would step into the leadership position of this new Laos. Forrestal and Sullivan, two of the negotiators, arrived in Laos to attempt to unite Vang Pao and Kong Le, which turns out unsuccessful. They observed the Vang Pao troop as being ill-equipped to fight their enemy [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1962,
        "mm":8,
        "dd":0
      },
      "idx":482,
      "txt":"August, NVA attacked Ban Ban area and as 6,000 Lao, Kmhmu and Hmong flee, they are caught, slaughtered and raped [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1962,
        "mm":10,
        "dd":0
      },
      "idx":483,
      "txt":"October, Cuban Missile Crisis [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1962,
        "mm":10,
        "dd":7
      },
      "idx":484,
      "txt":"Deadline for withdrawal of all foreign troops from Laos [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1963,
        "mm":0,
        "dd":0
      },
      "idx":485,
      "txt":"Shong Lue Yang fled from Tham Ha to Fi Kha when communist troops attempt to arrest him. He later sent a delegation to get protection from Vang Pao [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1963,
        "mm":4,
        "dd":0
      },
      "idx":486,
      "txt":"April, Pathet Lao attacked Kong Le and forced Kong Le from Khang Khay [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1963,
        "mm":5,
        "dd":12
      },
      "idx":487,
      "txt":"State Department responded to Kong Le defeat by stepping up supply [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1963,
        "mm":11,
        "dd":0
      },
      "idx":488,
      "txt":"November, JFK is assassinated. LBJ became President. Over 16,000 US military personnel remained in Laos."
    },
    {
      "date":{
        "era":1,
        "yr":1963,
        "mm":11,
        "dd":3
      },
      "idx":489,
      "txt":"South Vietnamese Premier Diem was assassinated [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1964,
        "mm":0,
        "dd":0
      },
      "idx":490,
      "txt":"North Vietnamese and Pathet Lao occupied PDJ [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1964,
        "mm":0,
        "dd":0
      },
      "idx":491,
      "txt":"Vang Pao was promoted to General in the Royal Lao Army. 30,000 Hmongs were involved at this time with the fight against the NVA--each being paid 10 cents per day along with the 'promise' of being taken care by the US government [56]."
    },
    {
      "date":{
        "era":1,
        "yr":1964,
        "mm":0,
        "dd":0
      },
      "idx":492,
      "txt":"Shong Lue Yang fled back to Tham Ha from Fi Kha after communist attack [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1964,
        "mm":6,
        "dd":7
      },
      "idx":493,
      "txt":"NVA, Kong Le and Pathet took Padong stronghold. Hmongs surviving the defeat moved to Yat Mo and then Pha Khao [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1964,
        "mm":8,
        "dd":4
      },
      "idx":494,
      "txt":"Gulf of Tonkin incident where North Vietnanmese shoot US destroyer, Maddox, led to retaliation by President Johnson to issue airstrikes against the North Vietnamese [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1964,
        "mm":8,
        "dd":7
      },
      "idx":495,
      "txt":"Gulf of Tonkin Resolution is passed and gave Johnson unlimited power to handle Southeast Asia [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1964,
        "mm":9,
        "dd":0
      },
      "idx":496,
      "txt":"Shong Lue Yang moved to Kiaw Boua [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1964,
        "mm":10,
        "dd":0
      },
      "idx":497,
      "txt":"October, China exploded its first atomic bomb. Krushchev is ousted and replaced by Brezhnev and Kosygin [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1964,
        "mm":12,
        "dd":0
      },
      "idx":498,
      "txt":"December, President Johnson is reelected. Operation Barrel Roll is launched as fighter jets in Thailand fly to bomb nothern Lao in support of the Hmongs [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1965,
        "mm":0,
        "dd":0
      },
      "idx":499,
      "txt":"Mao Zedong began the Great Proletarian Cultural Revolution [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1965,
        "mm":0,
        "dd":0
      },
      "idx":500,
      "txt":"Air Force at Udorn Air Base in Thailand was activated to provide air support in secret fights [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1965,
        "mm":3,
        "dd":2
      },
      "idx":501,
      "txt":"Operation Rolling Thunder launched to bomb North Vietnam [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1965,
        "mm":4,
        "dd":0
      },
      "idx":502,
      "txt":"Shong Lue Yang introduced Second Stage Reduced Version of Pahawh Hmong and Pahawh Khmu [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1966,
        "mm":0,
        "dd":0
      },
      "idx":503,
      "txt":"Hmong New Year, Vang Pao took a Laotion wife, Mae La, to prove his love for the Laotions and Laos. [55]"
    },
    {
      "date":{
        "era":1,
        "yr":1966,
        "mm":0,
        "dd":0
      },
      "idx":504,
      "txt":"Shong Lue Yang is detained at Long Cheng [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1966,
        "mm":2,
        "dd":17
      },
      "idx":505,
      "txt":"Vang Pao's third military base, Na Khang, is taken by NVA and Pathet Lao troops. Prior to the defeat, Vang Pao was shot in the arm by enemy fire and medevacked to Thailand for surgery. By this time, Vang Pao became the undisputed Hmong leader in Indochina, overshadowing Lyfoung Touby. With Vang Pao disabled in Thailand, a coup against him occurred via the efforts of Ly clan members in Long Chieng. Lyfoung Touby was accused of scheming the coup, however, his daughters insist an official investigation ensue to clear their father of this charge [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1966,
        "mm":8,
        "dd":16
      },
      "idx":506,
      "txt":"Vang Pao's military success showed as he pushed NVA troops beyond Nam Bac, an area 45 miles from the North Vietnamese border [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1967,
        "mm":0,
        "dd":0
      },
      "idx":507,
      "txt":"Vang Pao is a general by this time. Ly Lue and Vang Toua earned their wings as Chaophakaow. Vang Toua is killed in action shortly after taking to the skies. Hmong irregular forces are known as Special Guerrilla Units (SGUs) and later as Groupes Mobiles (GM). By this time, figures estimate that the 20,000 indigenous troops were paid $0.10 per day per person ($2,000 total per day) or $60,000 per month. Auto Defense de Choc (ADC) and Auto Defense Ordinaire (ADO) forces, organized and funded by the Royal Lao government, received weapons and salaries of $2-3 per month or 1,000-2,000 kips per month. During time, the US Department of Defense stepped up involvement with military personnel and supply into Laos. The State Department's counterinsurgency efforts and authority began to diminish [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1967,
        "mm":0,
        "dd":0
      },
      "idx":508,
      "txt":"US installed top-secret equipment atop Phou Pha Thi in Laos for 24-7, all-weather precision bombing against targets in north Loas and North Vietnam [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1967,
        "mm":2,
        "dd":2
      },
      "idx":509,
      "txt":"Laung Prabang airfield is destroyed by the communist troop [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1967,
        "mm":9,
        "dd":15
      },
      "idx":510,
      "txt":"Shong Lue Yang is jailed for contact with followers of Chao Fa in communist-controlled area [49, 55]."
    },
    {
      "date":{
        "era":1,
        "yr":1967,
        "mm":10,
        "dd":21
      },
      "idx":511,
      "txt":"50,000 protestors demonstrated against the Vietnam War and LBJ at the Pentagon [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1967,
        "mm":11,
        "dd":0
      },
      "idx":512,
      "txt":"November, Bertrand Russell and his International War Crimes Tribunal opened their second session [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1968,
        "mm":0,
        "dd":0
      },
      "idx":513,
      "txt":"North Koreans captured USS Pueblo [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1968,
        "mm":1,
        "dd":1
      },
      "idx":514,
      "txt":"Hanoi agreed to talk with the US if all bombings stopped. Bombing had stopped as previously agreed on both side due to the Tet New Year. Delay of bombing was to buy Hanoi time to move weapons and troops into position to take over US Air Force base in Phou Pha Thi [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1968,
        "mm":1,
        "dd":31
      },
      "idx":515,
      "txt":"General Giap launched Tet Offensive throughout South Vietnam [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1968,
        "mm":2,
        "dd":18
      },
      "idx":516,
      "txt":"Hmongs obtained detail NVA plans to take Phou Pha Thi [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1968,
        "mm":3,
        "dd":10
      },
      "idx":517,
      "txt":"Phou Pha Thi was attacked by NVA and taken later. American and Hmong versions of the fall of Phou Pha Thi differed [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1968,
        "mm":10,
        "dd":1
      },
      "idx":518,
      "txt":"General Vang Pao secretly visited Johnson White House officials, including Special Assistant to the President, Walt Rostow [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1968,
        "mm":10,
        "dd":31
      },
      "idx":519,
      "txt":"LBJ ordered a complete halt to all air, naval and artillery bombardment of North Vietnam [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1968,
        "mm":11,
        "dd":5
      },
      "idx":520,
      "txt":"Nixon was elected President [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1968,
        "mm":11,
        "dd":14
      },
      "idx":521,
      "txt":"LBJ wrote thank you letter to General Vang Pao and for the Hmong handcrafted rifle [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1968,
        "mm":12,
        "dd":0
      },
      "idx":522,
      "txt":"December, Captain Fred Walker left Laos assignment for Thailand assignment. General Vang Pao gave Walker a 4 pound silver necklace [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1969,
        "mm":0,
        "dd":0
      },
      "idx":523,
      "txt":"Senator William Fulbright revealed that the CIA ran military operations in Laos [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1969,
        "mm":0,
        "dd":0
      },
      "idx":524,
      "txt":"Vang Pao proclaimed that Hmongs have earned the right to be called Hmongs and no longer Meo [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1969,
        "mm":1,
        "dd":16
      },
      "idx":525,
      "txt":"In Paris, US and North Vietnam agreed on the shape of the negotiating table to be round. Henry A. Kissinger took the place of Averall Harriman under the Nixon Administration [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1969,
        "mm":3,
        "dd":0
      },
      "idx":526,
      "txt":"March, In operation Menu, Nixon covertly approved the bombing of Cambodia. Cambodia is believed to be a place of sanctuaries for the NVA [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1969,
        "mm":3,
        "dd":1
      },
      "idx":527,
      "txt":"Na Khang, the Alamo, fell. Long Chieng and Bouam Loung (held by Moua Cher Pao) remained among the few remaining centers of importance [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1969,
        "mm":3,
        "dd":23
      },
      "idx":528,
      "txt":"Countering the loss of Na Khang, General Vang Pao coordinated US Air supported fight against the NVA at PDJ [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1969,
        "mm":5,
        "dd":0
      },
      "idx":529,
      "txt":"May, Nixon proposed NVA and US personnel out of South Vietnam [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1969,
        "mm":6,
        "dd":8
      },
      "idx":530,
      "txt":"Nixon annouced unilateral withdrawal of 25,000 troops from South Vietnam. Months later, a 35,000 troop withdrawal followed. These actions were the beggning of the de-Americanization or Vietnamization of Southeast Asia [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1969,
        "mm":6,
        "dd":24
      },
      "idx":531,
      "txt":"NVA captured Muong Soui, a strategic military site and airfield for the Royal Lao troops [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1969,
        "mm":7,
        "dd":1
      },
      "idx":532,
      "txt":"General Vang Pao ordered air-supported fight to retake Muong Soui. Ly Lue was shot down and killed. [55]"
    },
    {
      "date":{
        "era":1,
        "yr":1969,
        "mm":8,
        "dd":0
      },
      "idx":533,
      "txt":"August, General Vang Pao launched Operation About Face to retake PDJ [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1969,
        "mm":9,
        "dd":12
      },
      "idx":534,
      "txt":"General Vang Pao succeeded in taking Xieng Khouang and Lima Lima airfield [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1969,
        "mm":9,
        "dd":13
      },
      "idx":535,
      "txt":"Ho Chi Minh died [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1969,
        "mm":9,
        "dd":28
      },
      "idx":536,
      "txt":"Muong Soui was taken by General Vang Pao troops [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1969,
        "mm":10,
        "dd":0
      },
      "idx":537,
      "txt":"October, Senator Stuart Symington conducted secret hearing in Laos [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1969,
        "mm":10,
        "dd":20
      },
      "idx":538,
      "txt":"Senator Stuart Symington opened secret hearings on Laos. Under questioning of Symington, Senator JW Fulbright and Roland A. Paul maintained that the US had no moral commitment to Laos, the Lao Royal government or Vang Pao. US efforts in Laos were a commitment to USSR in the Kennedy-Khrushchev agreement of keeping Laos a neutral country [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":0,
        "dd":0
      },
      "idx":539,
      "txt":"Prince Sihanouk of Cambodia is overthrowned by General Lon Nol [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":0,
        "dd":0
      },
      "idx":540,
      "txt":"In the early 1970's, the Whitelock Lao-based Alphabet writing system for the Hmong language was created [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":0,
        "dd":0
      },
      "idx":541,
      "txt":"n the early 1970's, so-called Anonymous Writing System for the Hmong language was created [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":1,
        "dd":23
      },
      "idx":542,
      "txt":"Ambassador Godley to Laos requested B-52 strikes [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":2,
        "dd":0
      },
      "idx":543,
      "txt":"February, B-52 began to be used in Laos. Kissinger conducted secret talks with North Vietnamese in Paris [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":2,
        "dd":13
      },
      "idx":544,
      "txt":"Souvanna Phouma formally requested B-52 strikes [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":2,
        "dd":16
      },
      "idx":545,
      "txt":"NVA and Pathet Lao drove their way to PDJ. Kissinger recommended Nixon to use B-52 if NVA and Pathet Lao advance beyond Muong Soui [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":2,
        "dd":17
      },
      "idx":546,
      "txt":"3 B-52's strike NVA and Pathet Lao troops in northern Laos and PDJ area as ordered by Nixon [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":2,
        "dd":21
      },
      "idx":547,
      "txt":"General Vang Pao ordered Lima Lima and PDJ to be abandoned temporarily. Henry Kissinger prepared for another secret meeting with the Le Duc Tho of North Vietnamese in Paris [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":2,
        "dd":25
      },
      "idx":548,
      "txt":"Senators Mathias, Mansfield, Gore, Symington, Cooper and Percy attacked Kissinger and Nixon secret policies in Laos [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":2,
        "dd":27
      },
      "idx":549,
      "txt":"Nixon and Kissinger prepared White House statement on US activities in Laos [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":3,
        "dd":6
      },
      "idx":550,
      "txt":"Nixon revealed for the first time, US presence in Laos [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":3,
        "dd":16
      },
      "idx":551,
      "txt":"Round two of Kissinger-Le Duc Tho meeting began [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":3,
        "dd":18
      },
      "idx":552,
      "txt":"A National Assembly vote removed Prince Norodom Sihanouk as head of state, and General Lon Nol replaced the prince [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":3,
        "dd":19
      },
      "idx":553,
      "txt":"Thai troops helped Hmongs to defend Long Chieng [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":4,
        "dd":1
      },
      "idx":554,
      "txt":"NVA troops withdrew from Long Chieng's Skyline [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":4,
        "dd":4
      },
      "idx":555,
      "txt":"Third Kissinger-Le Duc Tho meeting. The US was blamed for the agression and war [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":4,
        "dd":30
      },
      "idx":556,
      "txt":"Nixon explained how Vietnamization will be required to eliminate communist sanctuaries in Cambodia [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":5,
        "dd":0
      },
      "idx":557,
      "txt":"May, Fighther pilot, Vang Seng was shot down in air mission [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":5,
        "dd":5
      },
      "idx":558,
      "txt":"Ohio National Guardsmen killed four youths in an antiwar demonstration [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":5,
        "dd":9
      },
      "idx":559,
      "txt":"75,000 to 100,000 war protesters demonstrated in front of the White House [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":8,
        "dd":0
      },
      "idx":560,
      "txt":"Shong Lue Yang finished Third Stage Reduced Version of Pahawh Hmong [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":9,
        "dd":0
      },
      "idx":561,
      "txt":"September, McGovern-Hatfield amendment, which set December 31,1971 as the date to withdraw US troops completely, is defeated [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":11,
        "dd":8
      },
      "idx":562,
      "txt":"Shong Lue Yang is rescued from prison and tkane to Nam Chia [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1970,
        "mm":11,
        "dd":20
      },
      "idx":563,
      "txt":"Mission ordered by White House to retrieve US POWs [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1971,
        "mm":0,
        "dd":0
      },
      "idx":564,
      "txt":"Fall, Hmong demoralization of heavy losses and disillusionment of US withdrawal suggested the near collapse of the Hmong. It is estimated most Hmong families were reduced to a surviving male of 13 years [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1971,
        "mm":1,
        "dd":21
      },
      "idx":565,
      "txt":"Shong Lue Yang finished Pahawh Hmong Final Version."
    },
    {
      "date":{
        "era":1,
        "yr":1971,
        "mm":2,
        "dd":0
      },
      "idx":566,
      "txt":"February, Nixon met Mao Zedong of China [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1971,
        "mm":2,
        "dd":0
      },
      "idx":567,
      "txt":"February, Pathet Lao held secret meeting at Vien Sai in the Sam Neua Province, and US resignaled their bold commitment to withdrawal. In this meeting, a central governing body of 7 politburo men were installed. The Lao People's Party became the Lao People's Revolutionary Party, and communist strategy for ultimate takeover of Laos began. Lao leaders included Prince Souphanouvong and the strongest leadership, Kaysone Phomvihane [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1971,
        "mm":2,
        "dd":8
      },
      "idx":568,
      "txt":"Operation Lam Son 719 led South Vietnam to cross into Laos and fight North Vietnam [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1971,
        "mm":2,
        "dd":14
      },
      "idx":569,
      "txt":"Valentine's Day Massacre occurred when NVA and Pathet Lao attacked Long Chieng [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1971,
        "mm":2,
        "dd":15
      },
      "idx":570,
      "txt":"Shong Lue Yang is assasinated [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1971,
        "mm":3,
        "dd":0
      },
      "idx":571,
      "txt":"March, Operation Lam Son 719 began to fail as South Vietnamese moved out of Laos [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1971,
        "mm":4,
        "dd":15
      },
      "idx":572,
      "txt":"General Vang Pao's troop took enemy positions at Skyline and Phou Pha Xai mountain."
    },
    {
      "date":{
        "era":1,
        "yr":1971,
        "mm":5,
        "dd":20
      },
      "idx":573,
      "txt":"NVA troops launched attack on Bouam Loung, site where Moua Cher Pao swore with his troops in a \"drinking of the water\" ceremony would never abandon this site. Moua Cher Pao's site is helped by new FAG technology called \"offset beacon bombing,\" where aircraft could lock onto target without visual contact. By the end of May, NVA troops ceased significant efforts to attempt to overtake Bouam Loung [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1971,
        "mm":6,
        "dd":0
      },
      "idx":574,
      "txt":"June, Senate passed Mansfield amendment, which called for the President to widthdraw all forces from Southeast Asia provided that American POWs are released by North Vietnam [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1971,
        "mm":6,
        "dd":22
      },
      "idx":575,
      "txt":"Mansfield amendment was passed, which stated for the President to withdraw all US troops if Hanoi released US POWs [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1971,
        "mm":6,
        "dd":26
      },
      "idx":576,
      "txt":"Le Duc Tho and Kissinger met secretly in Paris. Le Duc Tho agreed to release all US POWs on the day of US withdrawal and with the US to dismantled the South Vietnam Thieu government. Le Duc Tho also demanded war reparations and suggested an assassination of Thieu [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1971,
        "mm":7,
        "dd":0
      },
      "idx":577,
      "txt":"July, Kissinger met with Chou En Lai and Mao Zedong as a primer for 1972 Nixon-Zedong meeting. [55]"
    },
    {
      "date":{
        "era":1,
        "yr":1971,
        "mm":7,
        "dd":0
      },
      "idx":578,
      "txt":"July, Jane Fonda arrived to act in the theatre of anti-war propaganda. Her presence with NVA anit-aircraft gunners and plea for humane treatment of US POWs were coordinated earlier by North Vietnam in Paris [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1971,
        "mm":7,
        "dd":1
      },
      "idx":579,
      "txt":"July, Beginning in July, significant US troops and supply withdrawal would be realized. King Savang Vatthana and Prime Minister Souvanna Phouma ordered General Vang Pao to gain as much territory as possible before the July 1 deadline. General Vang Pao ordered phase 2 of his attempt to remove NVA from PDJ [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1971,
        "mm":8,
        "dd":5
      },
      "idx":580,
      "txt":"US and USSR submitted text on banning biological and toxic weapons at the Conference of the Committee on Disarmament [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1971,
        "mm":8,
        "dd":28
      },
      "idx":581,
      "txt":"White House make clear they are running the show in Laos and not the CIA or State Department. All plans of operations were required to be submitted 10 days in advance of the operation [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1971,
        "mm":11,
        "dd":19
      },
      "idx":582,
      "txt":"Two Russian MIGs are spotted over Ban Ban. Bouam Loung was later bombed [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1971,
        "mm":12,
        "dd":0
      },
      "idx":583,
      "txt":"December, North Vietnam launched a massive attack against the Hmong base in northern Laos [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1971,
        "mm":12,
        "dd":17
      },
      "idx":584,
      "txt":"NVA launched full scale attack against firebase Tom Tom. Firebase Mustang and Hmong positions, Fox Bravo and Fox Echo, began to fall [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1971,
        "mm":12,
        "dd":20
      },
      "idx":585,
      "txt":"Tom Tom and Mustang were overran [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1971,
        "mm":12,
        "dd":29
      },
      "idx":586,
      "txt":"Long Chieng was on the eve of destruction by NVA. Ban Sornwas designated the new frontline resupply and redeployment center as Long Chieng fell [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1972,
        "mm":1,
        "dd":25
      },
      "idx":587,
      "txt":"Nixon disclosed Kissinger's secret meeting with North Vietnam and commitment to total US withdrawal. He also accepted South Vietnam's President and Vice-President's resignations. The Viet Cong's politcal party, the National Liberation Front, are allowed to participate in South Vietnam's soon presidential elections. Nixon spoke also of spending billions of dollars in Indochina, which North Vietnam may reap, after the post-war years for reconstruction [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1972,
        "mm":1,
        "dd":26
      },
      "idx":588,
      "txt":"North Vietnam rejected Nixon's proposals [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1972,
        "mm":4,
        "dd":10
      },
      "idx":589,
      "txt":"Nixon signed Biological and Toxin Convention to ban such weapons, although no inspection apparatus is discussed. This treaty was one of many negotiating products of Kissinger-Russian meetings [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1972,
        "mm":4,
        "dd":20
      },
      "idx":590,
      "txt":"Kissinger arrived in Moscow secretly. His meeting with Premier Leonid Brezhnev ensured US withdrawal with virtually no need for NVA withdrawal from Laos or South Vietnam [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1972,
        "mm":8,
        "dd":1
      },
      "idx":591,
      "txt":"Le Duc Tho-Kissinger meeting in Paris, again, ensured US back out of Southeast Asia [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1972,
        "mm":8,
        "dd":22
      },
      "idx":592,
      "txt":"Nixon gained the Republican Presidential Candidate again. He later announced in July of the following year that there would be no more drafting. US troops numbered 47,000 by this time in South Vietnam. [55]"
    },
    {
      "date":{
        "era":1,
        "yr":1972,
        "mm":10,
        "dd":8
      },
      "idx":593,
      "txt":"Le Duc Tho-Kissinger meeting in Paris strictly allowed only North Vietnam-US decisions in the removal of US troops and post-US involvement government set up in Southeast Asia [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1972,
        "mm":10,
        "dd":14
      },
      "idx":594,
      "txt":"Pathet Lao delegation headed to Vientiane to discuss the ending of the war in Laos. Cease-fire is set for January 23, 1973 [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1972,
        "mm":10,
        "dd":28
      },
      "idx":595,
      "txt":"Hanoi approved the 10/8 Le Duc Tho-Kissinger accord [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1972,
        "mm":11,
        "dd":7
      },
      "idx":596,
      "txt":"Nixon defeated McGovern for President [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1972,
        "mm":11,
        "dd":14
      },
      "idx":597,
      "txt":"Nixon assured South Vietnam President Thieu retaliation if North Vietnam violated the accords. President Thieu instigated changes to Hanoi-Washington accord [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1972,
        "mm":12,
        "dd":13
      },
      "idx":598,
      "txt":"Le Duc Tho canceled the accord due to Thieu changes. Nixons issued the \"talk or else\" policy to Le Duc Tho [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1972,
        "mm":12,
        "dd":18
      },
      "idx":599,
      "txt":"Linebacker Two goes on for 11 days bombing Hanoi and strategic sites as part of Nixon's \"or else\" plan [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1972,
        "mm":12,
        "dd":28
      },
      "idx":600,
      "txt":"Hanoi agreed to talk if bombings stopped [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1972,
        "mm":12,
        "dd":30
      },
      "idx":601,
      "txt":"Linebacker Two stopped. 26 US aircraft shot down with 93 airmen, while 31 became captured. [55]"
    },
    {
      "date":{
        "era":1,
        "yr":1973,
        "mm":1,
        "dd":27
      },
      "idx":602,
      "txt":"Cease-fire under the Agreement on Ending the War and Restoring Peace in Vietnam was signed in Paris. Much was asked of South Vietnam and little of North Vietnam. US troops would completely withdraw in 60 days, while Hanoi's 160,000 troop in South Vietnam and 70,000 troops in Laos remained still [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1973,
        "mm":2,
        "dd":12
      },
      "idx":603,
      "txt":"US POWs started to be released by North Vietnam. Their version of POW encampment differed from Jane Fonda. Fonda called the POWs hypocrites and liars [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1973,
        "mm":2,
        "dd":18
      },
      "idx":604,
      "txt":"General Vang Pao married May Song Moua, a nurse, as his third wife [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1973,
        "mm":2,
        "dd":22
      },
      "idx":605,
      "txt":"Peace agreement by the Lao called the Agreement on the Restoration of Peace and Reconciliation in Laos was signed. Royal capital Laung Prabang and administrative capital Vientiane were neutralized by having communists troops there as co-protectors. Cease-fire was effective 2/23 [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1973,
        "mm":4,
        "dd":0
      },
      "idx":606,
      "txt":"April, Pathet Lao revised the Agreement as a strategic blueprint for more gains [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1973,
        "mm":9,
        "dd":14
      },
      "idx":607,
      "txt":"The Vientiane Agreement was signed and signaled the collapse of the Royal Lao power [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1973,
        "mm":11,
        "dd":0
      },
      "idx":608,
      "txt":"November, Congress passed the War Powers Act, rendering presidential retaliation for violation of peace treaties impossible [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1974,
        "mm":0,
        "dd":0
      },
      "idx":609,
      "txt":"40,000 North Vietnamese troops remain in Laos [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1974,
        "mm":1,
        "dd":0
      },
      "idx":610,
      "txt":"January, National Geographic article by W.E. Garrett's article appeared documenting Dr. Yang Dao and LyTeck Ly Nhia Vue's optimistic views for the new coalition government of Laos. LyTeck Ly Nhia Vue professed the Pathet Lao will appoint him over Yang Dao as Hmong leader to replace Vang Pao [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1974,
        "mm":7,
        "dd":4
      },
      "idx":611,
      "txt":"June, The last Air America plane and US military personnel left Laos [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1974,
        "mm":8,
        "dd":0
      },
      "idx":612,
      "txt":"August, a student-lead political protest stormed in Vientiane to promote their 18 point program, which called for eliminating all foreign sources of cultural vices [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1974,
        "mm":8,
        "dd":0
      },
      "idx":613,
      "txt":"August, Nixon is replaced by Ford as President due to Watergate Scandal [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1974,
        "mm":8,
        "dd":0
      },
      "idx":614,
      "txt":"August, Borders of Laos is closed. Mekong River became an Iron Curtain, and isolated the Laotian government as a gulag [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1974,
        "mm":11,
        "dd":1
      },
      "idx":615,
      "txt":"Souvanna Phouma returned from France for medical treatment of a heart attack [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1974,
        "mm":12,
        "dd":31
      },
      "idx":616,
      "txt":"Souvanna Phouma was recorded telling American professor Joesph Zasloff that Laos would not go communist [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":0,
        "dd":0
      },
      "idx":617,
      "txt":"LyFong Touby met with General Vang Pao and investigated his options to defect. LyFong returned to Laos and was sent to Seminar Camp 5, where in 1979 he died [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":0,
        "dd":0
      },
      "idx":618,
      "txt":"General Vang Pao was evacuated to Thailand [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":0,
        "dd":0
      },
      "idx":619,
      "txt":"General Vang Pao was living in Montana [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":1,
        "dd":0
      },
      "idx":620,
      "txt":"January, North Vietnam launched offensive against South Vietnam. Congress denied Ford's request for aid to South Vietnam [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":1,
        "dd":22
      },
      "idx":621,
      "txt":"January, US ratified Biological and Toxin Convention [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":2,
        "dd":5
      },
      "idx":622,
      "txt":"The Lao People's Revolutionary Army (LPRA) and NVA attacked the Royal Lao at Sala Phou Khoun. [55]"
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":3,
        "dd":26
      },
      "idx":623,
      "txt":"USSR ratified Biological and Toxin Convention [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":3,
        "dd":27
      },
      "idx":624,
      "txt":"General Vang Pao troops protecting Sala Phou Khoun were under attack by LPRA troops [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":4,
        "dd":11
      },
      "idx":625,
      "txt":"Again, General Vang Pao troops protecting Sala Phou Khoun are under attack by LPRA troops. Prime Minister Souvanna Phouma criticized General Vang Pao for protecting Sala Phou Khoun. Dr. Yang Dao toured communist countries seeking support for a Laos coalition government. General Vang Pao under criticism planned to take Lao Air Force [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":4,
        "dd":17
      },
      "idx":626,
      "txt":"China-backed Pol Pot's communist Khmer Rouge took Cambodia [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":4,
        "dd":30
      },
      "idx":627,
      "txt":"Last US evacuation helicopter lifted off from the US Embassy in Saigon as the city is taken by the NVA. Saigon became Ho Chi Minh City and news of US-South Vietnam defeat reached Laos [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":5,
        "dd":8
      },
      "idx":628,
      "txt":"General Vang Pao at Long Chieng conducted a meeting among Hmong leaders regarding the decision to fight. They analyze the Paris Agreement of 1973 (Le Duc Tho-Kissinger), Agreement on the Restoration of Peace and Reconciliation of Laos, Vientiane Agreement, 18 point policy and a May 6th radio broadcast equivocally threatening the Hmong and other strategic military topics. By this time, Dr. Yang Dao is promoting Hmong integration with the LPRA government and was back from his communist country tour [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":5,
        "dd":9
      },
      "idx":629,
      "txt":"NVA took Sala Phou Khoun. Discussion of evacuation turned imminent among the Hmong and General Vang Pao. [55]"
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":5,
        "dd":10
      },
      "idx":630,
      "txt":"General Vang Pao was issued an ultimatum by the CIA to evacuate. General Vang Pao and 12 Hmongs signed a treaty acknowledging previous American pledges and their own pledge to never return to Laos. Prime Minister Souvanna Phouma replaced General Vang Pao on this day as Commander of Military Region II [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":5,
        "dd":11
      },
      "idx":631,
      "txt":"Hmong exodus from Laos began on C-47 planes. Dr. Yang Dao arrived at Long Chieng and fled as well."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":5,
        "dd":12
      },
      "idx":632,
      "txt":"Prince Sisouk na Champassak sent the last artillery support of Long Chieng before fleeing Laos."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":5,
        "dd":14
      },
      "idx":633,
      "txt":"General Vang Pao left Long Chieng to Phou Khang to bid farewell to Hmong villagers. He stopped at Muang Cha to board a plane to his final destination (Nam Phong) at Udorn Air Base. Some Hmongs, who no more planes would come for, but determined to follow General Vang Pao, set out on foot westward towards Ban Sorn. At Ban Sorn, some Hmongs determined going to Vientiane would be a much better option."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":5,
        "dd":15
      },
      "idx":634,
      "txt":"General Vang Pao's replacement arrived, named, General Chao Manivong with LyFong Touby at Long Chieng ."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":5,
        "dd":22
      },
      "idx":635,
      "txt":"Souvanna Phouma ordered LyFong Touby to persauve Hmongs to stop exodus into Thailand. Touby made a speech at Ban Sorn to thousands of Hmong that they have no worry since they are the population, and the problem, referring to General Vang Pao and those who had gone to Thailand, were gone. His speech was closely monitored by Pathet Lao officials [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":5,
        "dd":28
      },
      "idx":636,
      "txt":"10,000 Hmongs in exodus at Hin Heup Bridge were opened fire upon by the Pathet Lao [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":6,
        "dd":0
      },
      "idx":637,
      "txt":"June, US Air Foce was deactivated in Thailand [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":6,
        "dd":5
      },
      "idx":638,
      "txt":"Radio Pathet Lao reported its version of Hin Heup Bridge Massacre, citing Hmong attacks and disruption. Sia Sivang was noted in this broadcast as General Vang Pao's henchman. Prince Sai Kham, the last prince of Xieng Khouang, crossed the Mekong River and took refuge in a Thai Buddha temple [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":6,
        "dd":9
      },
      "idx":639,
      "txt":"Radio Pathet Lao announced Royal Lao Army officers request of Pathet Lao advisors. More propaganda against Hmong exodus was broadcast [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":6,
        "dd":10
      },
      "idx":640,
      "txt":"Vientiane Domestic Service airs Order 904 which required all weapons to be returned to arsenal depots in their respective military regions [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":7,
        "dd":0
      },
      "idx":641,
      "txt":"July, Former senior Royal Lao civilians and military were rounded up for seminar camps [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":7,
        "dd":30
      },
      "idx":642,
      "txt":"Royal Lao-Pathet Lao coalition government stopped. Pathet Lao controlled Laos as USSR supply move in and a house-cleaning of the old governing officials begins [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":8,
        "dd":22
      },
      "idx":643,
      "txt":"Lao-Thai border closed [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":9,
        "dd":0
      },
      "idx":644,
      "txt":"September, the people of the traditional governing structure in Laos are eliminated [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":11,
        "dd":28
      },
      "idx":645,
      "txt":"Vientiane rallied for abdication of the king occurred [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":12,
        "dd":0
      },
      "idx":646,
      "txt":"December, As the Lao People's Revolutionary Party took over, monarchy was abolished. Lao became known as LPDR [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":12,
        "dd":0
      },
      "idx":647,
      "txt":"By the time US troops evacuated Southeast Asia, 17,000 Hmong soldiers and 5,000 Hmong civilians were killed. An additional 100,000 Hmongs died in their flight from the communist Laos and Vietnam government to the US-backed Thailand refugee camps. In all, 122,000 Hmong lives were taken during and immediately after the Secret War [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1975,
        "mm":12,
        "dd":2
      },
      "idx":648,
      "txt":"The Kingdom of Laos was now the Lao People's Democratic Republic (LPDR). The Program of Action by the LPDR was enacted as well, and Kaysone Phomvihane replaced Prince Souphanouvong as the new leader. The royalty of Laos is effectively discontinued [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1976,
        "mm":0,
        "dd":0
      },
      "idx":649,
      "txt":"LyTeck Ly Nhia Vue was executed at Seminar Camp 6 [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1976,
        "mm":0,
        "dd":0
      },
      "idx":650,
      "txt":"LPDR and People's Army of Vietnam (PAVN) began the use of chemical-biological toxin warfare against Hmongs in Laos."
    },
    {
      "date":{
        "era":1,
        "yr":1976,
        "mm":0,
        "dd":0
      },
      "idx":651,
      "txt":"Carter was elected President [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1976,
        "mm":0,
        "dd":0
      },
      "idx":652,
      "txt":"Ban Vinai camp is created [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1976,
        "mm":11,
        "dd":3
      },
      "idx":653,
      "txt":"Lao royal family (King Savang Vatthana, Queen Khamphoui and Prince Vongsavang) was arrested and imprisoned in Seminar Camp 1, Sop Hoa at Vieng Sai, where LyFong Touby was also encamped [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1977,
        "mm":0,
        "dd":0
      },
      "idx":654,
      "txt":"Carter's 1977 Country Reports on Human Rights Practices (426 pages) did not list the country of Laos. [55]"
    },
    {
      "date":{
        "era":1,
        "yr":1977,
        "mm":3,
        "dd":0
      },
      "idx":655,
      "txt":"March, Carter explored the recognition of a communist Vietnam [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1977,
        "mm":7,
        "dd":18
      },
      "idx":656,
      "txt":"The Treaty of Friendship and Cooperation between LPDR and Socialist Republic of Vietnam reaffirmed the commitment to Marxims-Leninism and provided the legal basis for Vietnam involvement in Laos [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1978,
        "mm":0,
        "dd":0
      },
      "idx":657,
      "txt":"Communists massacred Hmong in Phou Bia area and started the \"final solution\" to exterminate Hmongs. Pathet Lao defectors estimate 50,000 were dead of poison and 45,000 were shot, died of starvation or tortured to death at Phou Bia [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1978,
        "mm":0,
        "dd":0
      },
      "idx":658,
      "txt":"Lyfoung Touby died at re-education camp in Sam Neua [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1978,
        "mm":0,
        "dd":0
      },
      "idx":659,
      "txt":"Pa Kao Her formed Ethnics Liberation Organization of Laos [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1978,
        "mm":2,
        "dd":5
      },
      "idx":660,
      "txt":"Prince Vongsavang died at Seminar Camp 1 [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1978,
        "mm":6,
        "dd":0
      },
      "idx":661,
      "txt":"June, Vietnam joined Comecon, the East European economic community. Carter signed SALT II with Premier Brezhnev [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1978,
        "mm":6,
        "dd":13
      },
      "idx":662,
      "txt":"King Savang Vatthana died at Seminar Camp 1 [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1978,
        "mm":9,
        "dd":4
      },
      "idx":663,
      "txt":"Queen Khamphoui died after she is moved to Seminar Camp 2 at Houei Bao in Houa Phan [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1978,
        "mm":12,
        "dd":0
      },
      "idx":664,
      "txt":"Soviet invaded Afghanistan in December [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1978,
        "mm":12,
        "dd":25
      },
      "idx":665,
      "txt":"December, Vietnam invaded Chinese-backed Pol Pot's Khmer Rouge and installed pro-Hanoi government in Cambodia [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1979,
        "mm":0,
        "dd":0
      },
      "idx":666,
      "txt":"Fall, Gary B. Croker of the State Department's Bureau of Intelligence and Research began investigation of biological/toxic chemical use in Laos with Colonel Charles W. Lewis as head of the investigation team [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1979,
        "mm":0,
        "dd":0
      },
      "idx":667,
      "txt":"Prince Sisouk na Champassak accused the world of a \"conspiracy of silence\" on the atrocities in Laos [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1979,
        "mm":2,
        "dd":0
      },
      "idx":668,
      "txt":"February, China invaded Vietnam [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1979,
        "mm":4,
        "dd":0
      },
      "idx":669,
      "txt":"April, Explosion of Soviet secret military compound released toxins and caused death [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1980,
        "mm":0,
        "dd":0
      },
      "idx":670,
      "txt":"Iran took American hostages [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1980,
        "mm":0,
        "dd":0
      },
      "idx":671,
      "txt":"Reagan was elected President [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1980,
        "mm":0,
        "dd":0
      },
      "idx":672,
      "txt":"December, UN adopted a resolution to investigate the use of chemical-biological warfare in Laos, Cambodia and Afghanistan [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1980,
        "mm":3,
        "dd":3
      },
      "idx":673,
      "txt":"Supporters of Pahawh Hmong formed Motthem Family [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1981,
        "mm":0,
        "dd":0
      },
      "idx":674,
      "txt":"Western scientists detected chemical agent used against Hmong, Cambodians and Afghanistanians. The origins of the chemicals used against the Hmongs were determined to be from the Soviet Union [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1981,
        "mm":0,
        "dd":0
      },
      "idx":675,
      "txt":"Lao and Hmong leaders, prompted by Prince Sisouk na Champassak and General Vang Pao, formed the United Lao National Liberation Front (ULNLF). Their goals were to break the conspiracy of silence and call for world support against the Kaysone government. ULNLF is also known as Neo Hom [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1981,
        "mm":3,
        "dd":7
      },
      "idx":676,
      "txt":"At the request of several Hmong leaders, General Vang Pao wrote to the Secretary of State Haig to complain of the Department of State's accusation of Hmong as heroin traffickers. General Vang Pao asked for an investigation into the use of bio-toxic chemicals against the Hmongs [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1981,
        "mm":4,
        "dd":29
      },
      "idx":677,
      "txt":"The Secretary of State's assistance's (John Holdridge) response to General Vang Pao reiterated that the UN had voted for an investigation and Congress has held hearings on the use of bio-toxin chemicals in Laos. [55]"
    },
    {
      "date":{
        "era":1,
        "yr":1981,
        "mm":5,
        "dd":9
      },
      "idx":678,
      "txt":"Dr. Yang Dao presented a paper at the University of Minnesota in an attempt to exonerate himself from negative communist associations [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1981,
        "mm":8,
        "dd":10
      },
      "idx":679,
      "txt":"Senator Hayakawa of California arrived in Laos. His visit is reported in March 1982, and although he is informed prior to his visit of bio-toxin chemical warfare against the Hmongs, Sen. Hayakawa's report does not mention anything regarding this issue [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1981,
        "mm":9,
        "dd":13
      },
      "idx":680,
      "txt":"Secretary of State Alexander Haig revealed US physical evidence of bio-toxic chemicals used in Southeast Asia to the Berlin Press Association. His announcements suggested the producers of such chemicals were from the USSR. Haig's statements were based on the National Intelligence Estimates [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1981,
        "mm":11,
        "dd":10
      },
      "idx":681,
      "txt":"US Senate Subcommittee on Arms Control scheduled hearing on biological weapons use in Southeast Asia and Afghanistan [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1981,
        "mm":12,
        "dd":15
      },
      "idx":682,
      "txt":"Dr. Khamseng Keo Sengsathit, Director of Public Health for LPDR, defected to China. He denounced the Le Duan (Vietnamese government) for the occupation of Laos, their expansionist policies and their use of chemical-biological weapons against national minorities [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1982,
        "mm":0,
        "dd":0
      },
      "idx":683,
      "txt":"Spring, LAWASIA launched investigation into CBW and concluded that CBW technology were employed in Southeast Asia [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1982,
        "mm":0,
        "dd":0
      },
      "idx":684,
      "txt":"House of Rep held hearings on chemical-biological weapons use in Laos, Cambodia and Afghanistans. [55]"
    },
    {
      "date":{
        "era":1,
        "yr":1982,
        "mm":3,
        "dd":22
      },
      "idx":685,
      "txt":"Secretary of State Alexander Haig submitted Chemical Warfare in Southeast Asia and Afghanistan based on National Intelligence Estimates. The report cited USSR and Vietnam use of CBW in Afghanistan and Southeast Asia, respectively [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1982,
        "mm":4,
        "dd":28
      },
      "idx":686,
      "txt":"Jerry Daniels, a long-time friend of the Hmong and veteran of the Indochina atrocious saga, died [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1983,
        "mm":7,
        "dd":0
      },
      "idx":687,
      "txt":"Ntawv Puaj Txwm, or the Syaboury Alphabet, is shown to United Nations High Commissioner for Refugees field officer, Nina Wimuttikosol, by Nkaj Vas Hawj [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1984,
        "mm":0,
        "dd":0
      },
      "idx":688,
      "txt":"Jack Anderson and Dale Van Atta offered explanation regarding US disinterest in bio-toxic chemical use in Laos. They noted that CIA analyst and biological weapons (BW) expert Julian Hoptman, the dominating figure in BW, simply gave no credence to any report hinting the cheating of the Soviets due to his commitment to the 1972 Biological and Toxin Weapons Convention [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1984,
        "mm":0,
        "dd":0
      },
      "idx":689,
      "txt":"Phang Day Lo died [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1984,
        "mm":0,
        "dd":0
      },
      "idx":690,
      "txt":"Reagan was reelected President [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1984,
        "mm":10,
        "dd":30
      },
      "idx":691,
      "txt":"Nova's The Mystery of Yellow Rain was aired. A pro-Meselson bee-dung theory view was presented [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1985,
        "mm":0,
        "dd":0
      },
      "idx":692,
      "txt":"Thailand began to repatriate Hmong refugees to Laos [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1985,
        "mm":0,
        "dd":0
      },
      "idx":693,
      "txt":"Txoov Yias Yaj was invited by the Institute for Southeast Asian Studies in Kunming, Yunnan to teach RPA to the Hmong Chinese [49]."
    },
    {
      "date":{
        "era":1,
        "yr":1985,
        "mm":6,
        "dd":0
      },
      "idx":694,
      "txt":"June, Her Pa Kao, the leader of Chao Fa, appeared in Angola in a meeting with Angola's Jonas Savimbi, Nicaraguan Democratic Force representatives and Afghan mujahedeen. This meeting was sponsored by millionaire Lewis Lehrman, founder of Citizens for America. Pa Kao Her left the meeting coronated as head of the Lao freedom fighters. This coronation teared apart and confused the Hmong community internationally regarding who was the ultimate Hmong leader [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1985,
        "mm":8,
        "dd":0
      },
      "idx":695,
      "txt":"August, Pa Kao Her appeared in Texas sponsored by the US Council for World Freedom, chaired by retired Army Major General John K Singlauv [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1985,
        "mm":9,
        "dd":21
      },
      "idx":696,
      "txt":"Pa Kao Her's 6 hours meeting in St. Paul, MN with Hmong leaders was taped. Yang Dao was present at this meeting as well [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1986,
        "mm":0,
        "dd":0
      },
      "idx":697,
      "txt":"\"A Journey to Laos,\" is produced by American Friends Service Committee workers, Jacqui Chagnon and Roger Rumpf [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1986,
        "mm":0,
        "dd":0
      },
      "idx":698,
      "txt":"Thailand's National Security Chief reports LPDR was involved in heroin trafficking [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1988,
        "mm":0,
        "dd":0
      },
      "idx":699,
      "txt":"LPDR narcotics-related corruption caused Laos not to receive US assistance [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1988,
        "mm":0,
        "dd":0
      },
      "idx":700,
      "txt":"Bush was President [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1989,
        "mm":0,
        "dd":0
      },
      "idx":701,
      "txt":"UN and US chartered the Comprehensive Plan of Action [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1989,
        "mm":0,
        "dd":0
      },
      "idx":702,
      "txt":"Lawyers Committee for Human Rights issued reports warning that the procedure for determining refugee status was conducted haphazardly, that extortion and bribery were widespread and that the \"Office of the UN High Commissioner for Refugees (UNHCR) in Thailand has proven incapable of ensuring a reliable and fair procedure. [55]"
    },
    {
      "date":{
        "era":1,
        "yr":1989,
        "mm":0,
        "dd":0
      },
      "idx":703,
      "txt":"Kaysone Phomvihane commended China for the crackdown on student demonstrations at Tiananmen Square. [55]"
    },
    {
      "date":{
        "era":1,
        "yr":1989,
        "mm":0,
        "dd":0
      },
      "idx":704,
      "txt":"LPDR make clear linkage between cooperation with US on POW/MIAs and on narcotics issues [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1989,
        "mm":11,
        "dd":0
      },
      "idx":705,
      "txt":"November, The Berlin Wall crumbled, and so does the rest of European communist governments [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1989,
        "mm":12,
        "dd":6
      },
      "idx":706,
      "txt":"December, ULNLF announced creation of Provisional Democratic Government inside Laos with 10,000 troops. They elected Prince Suriyavong Vongsavang to be king. Prince Phayaluang Outhong would be prime minister and General Vang Pao would be first deputy prime minister. Kaysone was enraged and vowed to bomb Laos until the Free Lao forces were exterminated [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1990,
        "mm":0,
        "dd":0
      },
      "idx":707,
      "txt":"LPDR remained a major opium trafficking state [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1990,
        "mm":0,
        "dd":0
      },
      "idx":708,
      "txt":"Glasnost and perestroika movement dominated Eastern Europe's communist policy [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1990,
        "mm":0,
        "dd":0
      },
      "idx":709,
      "txt":"Soviet support for LPDR diminished [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1990,
        "mm":0,
        "dd":0
      },
      "idx":710,
      "txt":"Census report in China estimated 7,398,035 Miao in China [2]. 3,686,900 in Guizhou 1,557,073 in Hunan 896,712 in Yunnan 535,923 in Sichuan 425,137 in Guanxi 200,702 in Hubei 52,044 in Nanhai"
    },
    {
      "date":{
        "era":1,
        "yr":1990,
        "mm":1,
        "dd":4
      },
      "idx":711,
      "txt":"20 MiG-21s from Vietnam dropped explosive and CBW in resistance area [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1990,
        "mm":1,
        "dd":13
      },
      "idx":712,
      "txt":"Resistance forces weakened significantly as PAVN and LPDR air forces bombed strategic areas. [55]"
    },
    {
      "date":{
        "era":1,
        "yr":1990,
        "mm":3,
        "dd":13
      },
      "idx":713,
      "txt":"US-funded construction programs began in Laos as part of a $8.7 million several-year aid package. [55]"
    },
    {
      "date":{
        "era":1,
        "yr":1990,
        "mm":6,
        "dd":4
      },
      "idx":714,
      "txt":"LPDR pubished a draft of its constitution in Pasason newspaper [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1990,
        "mm":7,
        "dd":0
      },
      "idx":715,
      "txt":"July, Lao resistance radio began to be broadcasted."
    },
    {
      "date":{
        "era":1,
        "yr":1990,
        "mm":7,
        "dd":1
      },
      "idx":716,
      "txt":"Radio Station of the Government of Liberation and of the Lao Nation called for the abolition of Marxist-Lenin style of government [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1990,
        "mm":10,
        "dd":0
      },
      "idx":717,
      "txt":"October, LPDR jailed communist cabinet vice-ministers for promoting a multi-party system [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1990,
        "mm":10,
        "dd":8
      },
      "idx":718,
      "txt":"6 LPDR officers denouncing Lao government were jailed. Phoumi Vongvichit was now acting President of LPDR [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1990,
        "mm":12,
        "dd":8
      },
      "idx":719,
      "txt":"\"Laos: Human Rights in a Forgotten Country,\" took place at Yale [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1991,
        "mm":0,
        "dd":0
      },
      "idx":720,
      "txt":"Vue Mai was used to promote repatriation within the refugee camps. He was also backed by the US to travel to the US to quell fears and concerns among journalists, legislators, human rights advocates and Hmongs living in the US [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1991,
        "mm":0,
        "dd":0
      },
      "idx":721,
      "txt":"Americans appealed to Congress without success or response for 3 years [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1991,
        "mm":0,
        "dd":0
      },
      "idx":722,
      "txt":"Laos began to lobby Congress for Most Favored Nation (MFN) trade status [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1991,
        "mm":0,
        "dd":0
      },
      "idx":723,
      "txt":"Vang Wangyee organized the Lao Veteran of America [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1991,
        "mm":0,
        "dd":0
      },
      "idx":724,
      "txt":"Soviet Union collapsed and its aid to Laos ended [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1991,
        "mm":3,
        "dd":0
      },
      "idx":725,
      "txt":"March, Fifth Lao Party Congress in Vientiane reaffirmed commitment to Marxism-Leninism [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1991,
        "mm":3,
        "dd":1
      },
      "idx":726,
      "txt":"Vue Mai's 10 point proposal kicked off self-volunteer repatriation of refugees from Thailand to Laos. 2 months later, this document was released in the US. Vue Mai was aided by US Rober Robinson and Briton Rober Cooper in drafting this document [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1991,
        "mm":3,
        "dd":7
      },
      "idx":727,
      "txt":"Bush administration gave Laos helicopter and training as US anti-narcotics aid [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1991,
        "mm":6,
        "dd":0
      },
      "idx":728,
      "txt":"June, US,UN,Laos and Thailand began repatriation programs of Hmongs from Thailand refugee camps back to Laos by way of the Tripartite Agreement [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1991,
        "mm":8,
        "dd":0
      },
      "idx":729,
      "txt":"August, Laos' Constitution was ratified, a Bill of Rights was absent [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1992,
        "mm":0,
        "dd":0
      },
      "idx":730,
      "txt":"Vue Mai is asked by the US State Department to lead the Hmong back to Laos under the monitoring and auspices of the UNHCR [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1992,
        "mm":0,
        "dd":0
      },
      "idx":731,
      "txt":"LPDR remained the 3rd largest producer of opium, producing 230 tons of opium or 19 tons of heroin [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1992,
        "mm":11,
        "dd":21
      },
      "idx":732,
      "txt":"November, Kaysone died [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1993,
        "mm":0,
        "dd":0
      },
      "idx":733,
      "txt":"Clinton was President. State Department denied Hmong repatriation atrocities [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1993,
        "mm":0,
        "dd":0
      },
      "idx":734,
      "txt":"15,000 Hmongs in Thailand refugee camps escaped repatriation to Laos and seeked asylum in Buddhist temples [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1993,
        "mm":9,
        "dd":11
      },
      "idx":735,
      "txt":"Vue Mai disappeared in Vientiane, Laos and was never heard from again [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1994,
        "mm":0,
        "dd":0
      },
      "idx":736,
      "txt":"Thirty years after Hmong and Americans came together in Laos, former CIA director, William E. Colby, testified to Congress the efforts of General Vang Pao against General Vo Nguyen Giap's 70,000 troops [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1994,
        "mm":0,
        "dd":0
      },
      "idx":737,
      "txt":"The House Foreign Affairs Committee added momentum to hold hearing on Laos's MFN application [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1994,
        "mm":0,
        "dd":0
      },
      "idx":738,
      "txt":"Fall 1994, a bipartisan effort informed Secretary of State Warren Christopher about the efficacy of the Tripartite Agreement [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1994,
        "mm":2,
        "dd":0
      },
      "idx":739,
      "txt":"February 1994, Marc Kaufman writes in the Philadelphia Inquirer about the ongoing involuntary repatriation of Hmongs to Laos and described a campaign by personnel of the US State Department and UNHCR to discredit Hmong American Leaders and Hmong refugees [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1994,
        "mm":4,
        "dd":26
      },
      "idx":740,
      "txt":"The House Foreign Affairs Subcommittee on Asian and Pacific Affairs scheduled this date for hearings."
    },
    {
      "date":{
        "era":1,
        "yr":1994,
        "mm":10,
        "dd":0
      },
      "idx":741,
      "txt":"October 1994, Brian Bonner documented abuses against Hmongs by LPDR [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1994,
        "mm":11,
        "dd":0
      },
      "idx":742,
      "txt":"November 1994, Rep. Benjamin Gilman (NY) became the Chair of House Committees for International Relations [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1995,
        "mm":0,
        "dd":0
      },
      "idx":743,
      "txt":"Refugee camps for the Hmongs in Thailand were all closed. Forced repatriation of Hmong refugee to Laos began while Thai, US and UN all approved this deadly measure despite facts and evidence revealing the political and human-rights state of Laos [56]."
    },
    {
      "date":{
        "era":1,
        "yr":1995,
        "mm":1,
        "dd":0
      },
      "idx":744,
      "txt":"January 1995, Rep. Steve Gunderson (WI), Gilman and Rep. Christopher Smith (NJ), the new chair of the Subcommittee on International Operations and Human Rights, began a five-man fact-finding mission to Thailand. [55]"
    },
    {
      "date":{
        "era":1,
        "yr":1995,
        "mm":3,
        "dd":0
      },
      "idx":745,
      "txt":"March 1995, Reports from Gunderson's-Gilman-Smith efforts found truth about State Department's deception and coverup of forced Hmong-repatritation atrocities. UNHCR was also found to have been feeding misleading information to Congress regarding Hmong repatriation [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1996,
        "mm":0,
        "dd":0
      },
      "idx":746,
      "txt":"Repatriation of Hmong is stopped [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1997,
        "mm":0,
        "dd":0
      },
      "idx":747,
      "txt":"A tradition is started as an annual May 14 and May 15th DC event honors Hmong and Lao Vietnam Veterans [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1997,
        "mm":5,
        "dd":15
      },
      "idx":748,
      "txt":"3,000 veterans of General Vang Pao's army were recognized for their efforts in the secret war. Vietnam Veterans National Medals were awarded [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1998,
        "mm":0,
        "dd":0
      },
      "idx":749,
      "txt":"Fresno City College dedicated a permanent memorial to Hmong Veterans on Memorial day [55]."
    },
    {
      "date":{
        "era":1,
        "yr":1998,
        "mm":7,
        "dd":0
      },
      "idx":750,
      "txt":"July. The Chinese government erected a temple in honor of ZhiYou, Huangdi and Yandi in Zhuolu [1]."
    },
    {
      "date":{
        "era":1,
        "yr":2000,
        "mm":4,
        "dd":0
      },
      "idx":751,
      "txt":"Zhang Xiumei, the Hmong leader during the Miao Rebellion was recognized by the Chinese government as a great leader against imperial rule [1]."
    },
    {
      "date":{
        "era":1,
        "yr":2007,
        "mm":6,
        "dd":4
      },
      "idx":752,
      "txt":"Harrison Ulrich Jack, Vang Pao, Lo Cha Thao, Lo Thao, Youa True Vang, Hue Vang, Chong Yang Thao, Seng Vue, and Chue Lo are charged with violation of US Neutrality Act Count 1 - 18 USC 371 - Conspiracy to violate Neutrality Act 18 USC 960 Count 2 - 18 USC 960 - Violation of Neutrality Act Count 3 - 18 USC 956(a) - Conspiracy to kill, kidnap, maim, and injure persons in a foreign country Count 4 - 18 USC 956(a) - Conspiracy to damage or destroy property within and belonging to a foreign country Count 5 - 18 USC 2332g - Conspiracy to receive and posses missile systems designed to destroy aircraft Count 6 - 18 USC 371 - Conspiracy to receive and posses destructive firearms, 922(o), 26 USC 5861."
    }
  ]